apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLOCKS</name>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xD4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CLOCKS_IRQ</name>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>CLK_GPOUT0_CTRL</name>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>clock generator is enabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUDGE</name>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASE</name>
              <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC50</name>
              <description>Enables duty cycle correction for odd divisors, can be changed on-the-fly</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Starts and stops the clock generator cleanly</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KILL</name>
              <description>Asynchronously kills the clock generator, enable must be set low before deasserting kill</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXSRC</name>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb_primary_ref_opcg</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_clksrc</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_peri</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_hstx</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>otp_clk2fc</name>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT0_DIV</name>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>Integer part of clock divisor, 0 -&gt; max+1, can be changed on-the-fly</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Fractional component of the divisor, can be changed on-the-fly</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT0_SELECTED</name>
          <description>Indicates which src is currently selected (one-hot)</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_GPOUT0_SELECTED</name>
              <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT1_CTRL</name>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>clock generator is enabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUDGE</name>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASE</name>
              <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC50</name>
              <description>Enables duty cycle correction for odd divisors, can be changed on-the-fly</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Starts and stops the clock generator cleanly</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KILL</name>
              <description>Asynchronously kills the clock generator, enable must be set low before deasserting kill</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXSRC</name>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb_primary_ref_opcg</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_clksrc</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_peri</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_hstx</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>otp_clk2fc</name>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT1_DIV</name>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>Integer part of clock divisor, 0 -&gt; max+1, can be changed on-the-fly</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Fractional component of the divisor, can be changed on-the-fly</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT1_SELECTED</name>
          <description>Indicates which src is currently selected (one-hot)</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_GPOUT1_SELECTED</name>
              <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT2_CTRL</name>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>clock generator is enabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUDGE</name>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASE</name>
              <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC50</name>
              <description>Enables duty cycle correction for odd divisors, can be changed on-the-fly</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Starts and stops the clock generator cleanly</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KILL</name>
              <description>Asynchronously kills the clock generator, enable must be set low before deasserting kill</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXSRC</name>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb_primary_ref_opcg</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_clksrc</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_peri</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_hstx</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>otp_clk2fc</name>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT2_DIV</name>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>Integer part of clock divisor, 0 -&gt; max+1, can be changed on-the-fly</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Fractional component of the divisor, can be changed on-the-fly</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT2_SELECTED</name>
          <description>Indicates which src is currently selected (one-hot)</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_GPOUT2_SELECTED</name>
              <description>This slice does not have a glitchless mux (only the AUX_SRC field is present, not SRC) so this register is hardwired to 0x1.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT3_CTRL</name>
          <description>Clock control, can be changed on-the-fly (except for auxsrc)</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLED</name>
              <description>clock generator is enabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUDGE</name>
              <description>An edge on this signal shifts the phase of the output by 1 cycle of the input clock 
                            This can be done at any time</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASE</name>
              <description>This delays the enable signal by up to 3 cycles of the input clock 
                            This must be set before the clock is enabled to have any effect</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DC50</name>
              <description>Enables duty cycle correction for odd divisors, can be changed on-the-fly</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Starts and stops the clock generator cleanly</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KILL</name>
              <description>Asynchronously kills the clock generator, enable must be set low before deasserting kill</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXSRC</name>
              <description>Selects the auxiliary clock source, will glitch when switching</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clksrc_pll_sys</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb_primary_ref_opcg</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_clksrc</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_peri</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_hstx</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>otp_clk2fc</name>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GPOUT3_DIV</name>
          <addressOffset>0x28</addressOffset>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>Integer part of clock divisor, 0 -&gt; max+1, can be changed on-the-fly</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Fractional component of the divisor, can be changed on-the-fly</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
