apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>DFTCLK_XOSC_CTRL</name>
          <addressOffset>0x78</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NULL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb_primary</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFTCLK_ROSC_CTRL</name>
          <addressOffset>0x7C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NULL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_sys_primary_rosc</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFTCLK_LPOSC_CTRL</name>
          <addressOffset>0x80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NULL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_pll_usb_primary_lposc</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_SYS_RESUS_CTRL</name>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <description>For clearing the resus after the fault that triggered it has been corrected</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCE</name>
              <description>Force a resus, for test purposes only</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable resus</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>This is expressed as a number of clk_ref cycles 
                            and must be &gt;= 2x clk_ref_freq/min_clk_tst_freq</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_SYS_RESUS_STATUS</name>
          <addressOffset>0x88</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESUSSED</name>
              <description>Clock has been resuscitated, correct the error then send ctrl_clear=1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_REF_KHZ</name>
          <description>Reference clock frequency in kHz</description>
          <addressOffset>0x8C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FC0_REF_KHZ</name>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_MIN_KHZ</name>
          <description>Minimum pass frequency in kHz. This is optional. Set to 0 if you are not using the pass/fail flags</description>
          <addressOffset>0x90</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FC0_MIN_KHZ</name>
              <bitRange>[24:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_MAX_KHZ</name>
          <description>Maximum pass frequency in kHz. This is optional. Set to 0x1ffffff if you are not using the pass/fail flags</description>
          <addressOffset>0x94</addressOffset>
          <resetValue>0x01FFFFFF</resetValue>
          <fields>
            <field>
              <name>FC0_MAX_KHZ</name>
              <bitRange>[24:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_DELAY</name>
          <description>Delays the start of frequency counting to allow the mux to settle 
                    Delay is measured in multiples of the reference clock period</description>
          <addressOffset>0x98</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FC0_DELAY</name>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_INTERVAL</name>
          <description>The test interval is 0.98us * 2**interval, but let's call it 1us * 2**interval 
                    The default gives a test interval of 250us</description>
          <addressOffset>0x9C</addressOffset>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>FC0_INTERVAL</name>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_SRC</name>
          <description>Clock sent to frequency counter, set to 0 when not required 
                    Writing to this register initiates the frequency count</description>
          <addressOffset>0xA0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FC0_SRC</name>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NULL</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pll_sys_clksrc_primary</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pll_usb_clksrc_primary</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rosc_clksrc_ph</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xosc_clksrc</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin0</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clksrc_gpin1</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_ref</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_sys</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_peri</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_usb</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_adc</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_hstx</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lposc_clksrc</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>otp_clk2fc</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pll_usb_clksrc_primary_dft</name>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_STATUS</name>
          <description>Frequency counter status</description>
          <addressOffset>0xA4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIED</name>
              <description>Test clock stopped during test</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST</name>
              <description>Test clock faster than expected, only valid when status_done=1</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLOW</name>
              <description>Test clock slower than expected, only valid when status_done=1</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FAIL</name>
              <description>Test failed</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WAITING</name>
              <description>Waiting for test clock to start</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>Test running</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DONE</name>
              <description>Test complete</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PASS</name>
              <description>Test passed</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC0_RESULT</name>
          <description>Result of frequency measurement, only valid when status_done=1</description>
          <addressOffset>0xA8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KHZ</name>
              <bitRange>[29:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAC</name>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKE_EN0</name>
          <description>enable clock in wake mode</description>
          <addressOffset>0xAC</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CLK_SYS_SIO</name>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SHA256</name>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PSM</name>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_ROSC</name>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_ROM</name>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_RESETS</name>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PWM</name>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_POWMAN</name>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_REF_POWMAN</name>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PLL_USB</name>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PLL_SYS</name>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PIO2</name>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PIO1</name>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PIO0</name>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_PADS</name>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_OTP</name>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_REF_OTP</name>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_JTAG</name>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_IO</name>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_I2C1</name>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_I2C0</name>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_HSTX</name>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_HSTX</name>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_GLITCH_DETECTOR</name>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_DMA</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_BUSFABRIC</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_BUSCTRL</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_BOOTRAM</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_ADC</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_ADC</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_ACCESSCTRL</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_CLOCKS</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKE_EN1</name>
          <description>enable clock in wake mode</description>
          <addressOffset>0xB0</addressOffset>
          <resetValue>0x7FFFFFFF</resetValue>
          <fields>
            <field>
              <name>CLK_SYS_XOSC</name>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_XIP</name>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_WATCHDOG</name>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_USB</name>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_USBCTRL</name>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_UART1</name>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PERI_UART1</name>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_UART0</name>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PERI_UART0</name>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_TRNG</name>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_TIMER1</name>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_TIMER0</name>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_TICKS</name>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_REF_TICKS</name>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_TBMAN</name>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SYSINFO</name>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SYSCFG</name>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM9</name>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM8</name>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM7</name>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM6</name>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM5</name>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM4</name>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM3</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM2</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM1</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SRAM0</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SPI1</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PERI_SPI1</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SYS_SPI0</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_PERI_SPI0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
