apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TICKS</name>
      <baseAddress>0x40108000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x48</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0xC</dimIncrement>
          <dimIndex>PROC0,PROC1,TIMER0,TIMER1,WATCHDOG,RISCV</dimIndex>
          <name>TICK%s</name>
          <description>Cluster TICK%s, containing *_CTRL, *_CYCLES, *_COUNT</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CTRL</name>
            <description>Controls the tick generator</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RUNNING</name>
                <description>Is the tick generator running?</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>start / stop tick generation</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CYCLES</name>
            <addressOffset>0x4</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PROC0_CYCLES</name>
                <description>Total number of clk_tick cycles before the next tick.</description>
                <bitRange>[8:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNT</name>
            <addressOffset>0x8</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>PROC0_COUNT</name>
                <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                <bitRange>[8:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>PADS_BANK0</name>
      <baseAddress>0x40038000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xCC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VOLTAGE_SELECT</name>
          <description>Voltage select. Per bank control</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VOLTAGE_SELECT</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3v3</name>
                  <description>Set voltage to 3.3V (DVDD &gt;= 2V5)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1v8</name>
                  <description>Set voltage to 1.8V (DVDD &lt;= 1V8)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-47</dimIndex>
          <name>GPIO%s</name>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000116</resetValue>
          <fields>
            <field>
              <name>ISO</name>
              <description>Pad isolation control. Remove this once the pad is configured by software.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OD</name>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Input enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive strength.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull up enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDE</name>
              <description>Pull down enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Enable schmitt trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEWFAST</name>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCLK</name>
          <addressOffset>0xC4</addressOffset>
          <resetValue>0x0000005A</resetValue>
          <fields>
            <field>
              <name>ISO</name>
              <description>Pad isolation control. Remove this once the pad is configured by software.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OD</name>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Input enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive strength.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull up enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDE</name>
              <description>Pull down enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Enable schmitt trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEWFAST</name>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD</name>
          <addressOffset>0xC8</addressOffset>
          <resetValue>0x0000005A</resetValue>
          <fields>
            <field>
              <name>ISO</name>
              <description>Pad isolation control. Remove this once the pad is configured by software.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OD</name>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Input enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive strength.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull up enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDE</name>
              <description>Pull down enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Enable schmitt trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEWFAST</name>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
