apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IO_QSPI</name>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x240</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>IO_IRQ_QSPI</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>IO_IRQ_QSPI_NS</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>USBPHY_DP_STATUS</name>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRQTOPROC</name>
              <description>interrupt to processors, after override is applied</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INFROMPAD</name>
              <description>input signal from pad, before filtering and override are applied</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OETOPAD</name>
              <description>output enable to pad after register override is applied</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTTOPAD</name>
              <description>output signal to pad after register override is applied</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPHY_DP_CTRL</name>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>IRQOVER</name>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>don't invert the interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>invert the interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>drive interrupt low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>drive interrupt high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INOVER</name>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>don't invert the peri input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>invert the peri input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>drive peri input low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>drive peri input high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OEOVER</name>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>drive output enable from peripheral signal selected by funcsel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable output</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTOVER</name>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>drive output from peripheral signal selected by funcsel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>drive output from inverse of peripheral signal selected by funcsel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>drive output low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>drive output high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUNCSEL</name>
              <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>uart1_tx</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c0_sda</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc_56</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>null</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPHY_DM_STATUS</name>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IRQTOPROC</name>
              <description>interrupt to processors, after override is applied</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INFROMPAD</name>
              <description>input signal from pad, before filtering and override are applied</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OETOPAD</name>
              <description>output enable to pad after register override is applied</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTTOPAD</name>
              <description>output signal to pad after register override is applied</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBPHY_DM_CTRL</name>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>IRQOVER</name>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>don't invert the interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>invert the interrupt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>drive interrupt low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>drive interrupt high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INOVER</name>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>don't invert the peri input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>invert the peri input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>drive peri input low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>drive peri input high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OEOVER</name>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>drive output enable from peripheral signal selected by funcsel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable output</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTOVER</name>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>drive output from peripheral signal selected by funcsel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>drive output from inverse of peripheral signal selected by funcsel</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>drive output low</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>drive output high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUNCSEL</name>
              <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>uart1_rx</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>i2c0_scl</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc_57</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>null</name>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>SCLK,SS,SD0,SD1,SD2,SD3</dimIndex>
          <name>GPIO_QSPI%s</name>
          <description>Cluster GPIO_QSPI%s, containing GPIO_QSPI_*_STATUS, GPIO_QSPI_*_CTRL</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>GPIO_STATUS</name>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>IRQTOPROC</name>
                <description>interrupt to processors, after override is applied</description>
                <bitRange>[26:26]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INFROMPAD</name>
                <description>input signal from pad, before filtering and override are applied</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OETOPAD</name>
                <description>output enable to pad after register override is applied</description>
                <bitRange>[13:13]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTTOPAD</name>
                <description>output signal to pad after register override is applied</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GPIO_CTRL</name>
            <addressOffset>0x4</addressOffset>
            <resetValue>0x0000001F</resetValue>
            <fields>
              <field>
                <name>IRQOVER</name>
                <bitRange>[29:28]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>don't invert the interrupt</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERT</name>
                    <description>invert the interrupt</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOW</name>
                    <description>drive interrupt low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGH</name>
                    <description>drive interrupt high</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INOVER</name>
                <bitRange>[17:16]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>don't invert the peri input</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERT</name>
                    <description>invert the peri input</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOW</name>
                    <description>drive peri input low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGH</name>
                    <description>drive peri input high</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OEOVER</name>
                <bitRange>[15:14]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>drive output enable from peripheral signal selected by funcsel</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERT</name>
                    <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>disable output</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>enable output</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OUTOVER</name>
                <bitRange>[13:12]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>drive output from peripheral signal selected by funcsel</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INVERT</name>
                    <description>drive output from inverse of peripheral signal selected by funcsel</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOW</name>
                    <description>drive output low</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGH</name>
                    <description>drive output high</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FUNCSEL</name>
                <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>xip_sclk</name>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>uart1_cts</name>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>i2c1_sda</name>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>siob_proc_58</name>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>uart1_tx</name>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>null</name>
                    <value>31</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>IRQSUMMARY_PROC0_SECURE</name>
          <addressOffset>0x200</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPIO_QSPI_SD3</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_QSPI_SD2</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_QSPI_SD1</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_QSPI_SD0</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_QSPI_SS</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO_QSPI_SCLK</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USBPHY_DM</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USBPHY_DP</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
