apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>ITM_STIM30</name>
          <description>Provides the interface for generating Instrumentation packets</description>
          <addressOffset>0x78</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_STIM31</name>
          <description>Provides the interface for generating Instrumentation packets</description>
          <addressOffset>0x7C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIMULUS</name>
              <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_TER0</name>
          <description>Provide an individual enable bit for each ITM_STIM register</description>
          <addressOffset>0xE00</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIMENA</name>
              <description>For STIMENA[m] in ITM_TER*n, controls whether ITM_STIM(32*n + m) is enabled</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_TPR</name>
          <description>Controls which stimulus ports can be accessed by unprivileged code</description>
          <addressOffset>0xE40</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIVMASK</name>
              <description>Bit mask to enable tracing on ITM stimulus ports</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_TCR</name>
          <description>Configures and controls transfers through the ITM interface</description>
          <addressOffset>0xE80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Indicates whether the ITM is currently processing events</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRACEBUSID</name>
              <description>Identifier for multi-source trace stream formatting. If multi-source trace is in use, the debugger must write a unique non-zero trace ID value to this field</description>
              <bitRange>[22:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GTSFREQ</name>
              <description>Defines how often the ITM generates a global timestamp, based on the global timestamp clock frequency, or disables generation of global timestamps</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSPRESCALE</name>
              <description>Local timestamp prescaler, used with the trace packet reference clock</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STALLENA</name>
              <description>Stall the PE to guarantee delivery of Data Trace packets.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWOENA</name>
              <description>Enables asynchronous clocking of the timestamp counter</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXENA</name>
              <description>Enables forwarding of hardware event packet from the DWT unit to the ITM for output to the TPIU</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCENA</name>
              <description>Enables Synchronization packet transmission for a synchronous TPIU</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENA</name>
              <description>Enables Local timestamp generation</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ITMENA</name>
              <description>Enables the ITM</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ATREADY</name>
          <description>Integration Mode: Read ATB Ready</description>
          <addressOffset>0xEF0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFVALID</name>
              <description>A read of this bit returns the value of AFVALID</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ATREADY</name>
              <description>A read of this bit returns the value of ATREADY</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ATVALID</name>
          <description>Integration Mode: Write ATB Valid</description>
          <addressOffset>0xEF8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFREADY</name>
              <description>A write to this bit gives the value of AFREADY</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATREADY</name>
              <description>A write to this bit gives the value of ATVALID</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_ITCTRL</name>
          <description>Integration Mode Control Register</description>
          <addressOffset>0xF00</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IME</name>
              <description>Integration mode enable bit - The possible values are:  0 - The trace unit is not in integration mode. 1 - The trace unit is in integration mode. This mode enables: A debug agent to perform topology detection. SoC test software to perform integration testing.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_DEVARCH</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFBC</addressOffset>
          <resetValue>0x47701A01</resetValue>
          <fields>
            <field>
              <name>ARCHITECT</name>
              <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
              <bitRange>[31:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>Defines that the DEVARCH register is present</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Defines the architecture revision of the component</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHVER</name>
              <description>Defines the architecture version of the component</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHPART</name>
              <description>Defines the architecture of the component</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_DEVTYPE</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFCC</addressOffset>
          <resetValue>0x00000043</resetValue>
          <fields>
            <field>
              <name>SUB</name>
              <description>Component sub-type</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Component major type</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR4</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFD0</addressOffset>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR5</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFD4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ITM_PIDR5</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR6</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ITM_PIDR6</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR7</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ITM_PIDR7</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR0</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFE0</addressOffset>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>PART_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR1</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFE4</addressOffset>
          <resetValue>0x000000BD</resetValue>
          <fields>
            <field>
              <name>DES_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR2</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFE8</addressOffset>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEDEC</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_PIDR3</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REVAND</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_CIDR0</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFF0</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_CIDR1</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFF4</addressOffset>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>CLASS</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_CIDR2</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFF8</addressOffset>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM_CIDR3</name>
          <description>Provides CoreSight discovery information for the ITM</description>
          <addressOffset>0xFFC</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CTRL</name>
          <description>Provides configuration and status information for the DWT unit, and used to control features of the unit</description>
          <addressOffset>0x1000</addressOffset>
          <resetValue>0x73741824</resetValue>
          <fields>
            <field>
              <name>NUMCOMP</name>
              <description>Number of DWT comparators implemented</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NOTRCPKT</name>
              <description>Indicates whether the implementation does not support trace</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NOEXTTRIG</name>
              <description>Reserved, RAZ</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NOCYCCNT</name>
              <description>Indicates whether the implementation does not include a cycle counter</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NOPRFCNT</name>
              <description>Indicates whether the implementation does not include the profiling counters</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CYCDISS</name>
              <description>Controls whether the cycle counter is disabled in Secure state</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCEVTENA</name>
              <description>Enables Event Counter packet generation on POSTCNT underflow</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOLDEVTENA</name>
              <description>Enables DWT_FOLDCNT counter</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSUEVTENA</name>
              <description>Enables DWT_LSUCNT counter</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPEVTENA</name>
              <description>Enable DWT_SLEEPCNT counter</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXCEVTENA</name>
              <description>Enables DWT_EXCCNT counter</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPIEVTENA</name>
              <description>Enables DWT_CPICNT counter</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTTRCENA</name>
              <description>Enables generation of Exception Trace packets</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCSAMPLENA</name>
              <description>Enables use of POSTCNT counter as a timer for Periodic PC Sample packet generation</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTAP</name>
              <description>Selects the position of the synchronization packet counter tap on the CYCCNT counter. This determines the Synchronization packet rate</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCTAP</name>
              <description>Selects the position of the POSTCNT tap on the CYCCNT counter</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTINIT</name>
              <description>Initial value for the POSTCNT counter</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POSTPRESET</name>
              <description>Reload value for the POSTCNT counter</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCCNTENA</name>
              <description>Enables CYCCNT</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CYCCNT</name>
          <description>Shows or sets the value of the processor cycle counter, CYCCNT</description>
          <addressOffset>0x1004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CYCCNT</name>
              <description>Increments one on each processor clock cycle when DWT_CTRL.CYCCNTENA == 1 and DEMCR.TRCENA == 1. On overflow, CYCCNT wraps to zero</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
