apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>DWT_EXCCNT</name>
          <description>Counts the total cycles spent in exception processing</description>
          <addressOffset>0x100C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXCCNT</name>
              <description>Counts one on each cycle when all of the following are true: - DWT_CTRL.EXCEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction is executed, see DWT_CPICNT. - An exception-entry or exception-exit related operation is in progress. - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_LSUCNT</name>
          <description>Increments on the additional cycles required to execute all load or store instructions</description>
          <addressOffset>0x1014</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSUCNT</name>
              <description>Counts one on each cycle when all of the following are true: - DWT_CTRL.LSUEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction is executed, see DWT_CPICNT. - No exception-entry or exception-exit operation is in progress, see DWT_EXCCNT. - A load-store operation is in progress. - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_FOLDCNT</name>
          <description>Increments on the additional cycles required to execute all load or store instructions</description>
          <addressOffset>0x1018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FOLDCNT</name>
              <description>Counts on each cycle when all of the following are true: - DWT_CTRL.FOLDEVTENA == 1 and DEMCR.TRCENA == 1. - At least two instructions are executed, see DWT_CPICNT. - Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-secure state and NoninvasiveDebugAllowed() == TRUE. The counter is incremented by the number of instructions executed, minus one</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_COMP0</name>
          <description>Provides a reference value for use by watchpoint comparator 0</description>
          <addressOffset>0x1020</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DWT_COMP0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_FUNCTION0</name>
          <description>Controls the operation of watchpoint comparator 0</description>
          <addressOffset>0x1028</addressOffset>
          <resetValue>0x58000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Identifies the capabilities for MATCH for comparator *n</description>
              <bitRange>[31:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>Set to 1 when the comparator matches</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>Controls the type of match generated by this comparator</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_COMP1</name>
          <description>Provides a reference value for use by watchpoint comparator 1</description>
          <addressOffset>0x1030</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DWT_COMP1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_FUNCTION1</name>
          <description>Controls the operation of watchpoint comparator 1</description>
          <addressOffset>0x1038</addressOffset>
          <resetValue>0x89000828</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Identifies the capabilities for MATCH for comparator *n</description>
              <bitRange>[31:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>Set to 1 when the comparator matches</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>Controls the type of match generated by this comparator</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_COMP2</name>
          <description>Provides a reference value for use by watchpoint comparator 2</description>
          <addressOffset>0x1040</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DWT_COMP2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_FUNCTION2</name>
          <description>Controls the operation of watchpoint comparator 2</description>
          <addressOffset>0x1048</addressOffset>
          <resetValue>0x50000000</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Identifies the capabilities for MATCH for comparator *n</description>
              <bitRange>[31:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>Set to 1 when the comparator matches</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>Controls the type of match generated by this comparator</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_COMP3</name>
          <description>Provides a reference value for use by watchpoint comparator 3</description>
          <addressOffset>0x1050</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DWT_COMP3</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_FUNCTION3</name>
          <description>Controls the operation of watchpoint comparator 3</description>
          <addressOffset>0x1058</addressOffset>
          <resetValue>0x20000800</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>Identifies the capabilities for MATCH for comparator *n</description>
              <bitRange>[31:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCHED</name>
              <description>Set to 1 when the comparator matches</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>Controls the type of match generated by this comparator</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_DEVARCH</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FBC</addressOffset>
          <resetValue>0x47701A02</resetValue>
          <fields>
            <field>
              <name>ARCHITECT</name>
              <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
              <bitRange>[31:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>Defines that the DEVARCH register is present</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Defines the architecture revision of the component</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHVER</name>
              <description>Defines the architecture version of the component</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHPART</name>
              <description>Defines the architecture of the component</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_DEVTYPE</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FCC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUB</name>
              <description>Component sub-type</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Component major type</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR4</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FD0</addressOffset>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR5</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FD4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DWT_PIDR5</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR6</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DWT_PIDR6</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR7</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DWT_PIDR7</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR0</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FE0</addressOffset>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>PART_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR1</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FE4</addressOffset>
          <resetValue>0x000000BD</resetValue>
          <fields>
            <field>
              <name>DES_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR2</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FE8</addressOffset>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEDEC</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PIDR3</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REVAND</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CIDR0</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FF0</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CIDR1</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FF4</addressOffset>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>CLASS</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CIDR2</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FF8</addressOffset>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CIDR3</name>
          <description>Provides CoreSight discovery information for the DWT</description>
          <addressOffset>0x1FFC</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_CTRL</name>
          <description>Provides FPB implementation information, and the global enable for the FPB unit</description>
          <addressOffset>0x2000</addressOffset>
          <resetValue>0x60005580</resetValue>
          <fields>
            <field>
              <name>REV</name>
              <description>Flash Patch and Breakpoint Unit architecture revision</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_CODE_14_12_</name>
              <description>Indicates the number of implemented instruction address comparators. Zero indicates no Instruction Address comparators are implemented. The Instruction Address comparators are numbered from 0 to NUM_CODE - 1</description>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_LIT</name>
              <description>Indicates the number of implemented literal address comparators. The Literal Address comparators are numbered from NUM_CODE to NUM_CODE + NUM_LIT - 1</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_CODE_7_4_</name>
              <description>Indicates the number of implemented instruction address comparators. Zero indicates no Instruction Address comparators are implemented. The Instruction Address comparators are numbered from 0 to NUM_CODE - 1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Writes to the FP_CTRL are ignored unless KEY is concurrently written to one</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enables the FPB</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
