apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>FP_REMAP</name>
          <description>Indicates whether the implementation supports Flash Patch remap and, if it does, holds the target address for remap</description>
          <addressOffset>0x2004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPSPT</name>
              <description>Indicates whether the FPB unit supports the Flash Patch remap function</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMAP</name>
              <description>Holds the bits[28:5] of the Flash Patch remap address</description>
              <bitRange>[28:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP0</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x2008</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP1</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x200C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP2</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x2010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP3</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x2014</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP4</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x2018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP5</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x201C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP6</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x2020</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_COMP7</name>
          <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
          <addressOffset>0x2024</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BE</name>
              <description>Selects between flashpatch and breakpoint functionality</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_DEVARCH</name>
          <description>Provides CoreSight discovery information for the FPB</description>
          <addressOffset>0x2FBC</addressOffset>
          <resetValue>0x47701A03</resetValue>
          <fields>
            <field>
              <name>ARCHITECT</name>
              <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
              <bitRange>[31:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>Defines that the DEVARCH register is present</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Defines the architecture revision of the component</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHVER</name>
              <description>Defines the architecture version of the component</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHPART</name>
              <description>Defines the architecture of the component</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_DEVTYPE</name>
          <description>Provides CoreSight discovery information for the FPB</description>
          <addressOffset>0x2FCC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUB</name>
              <description>Component sub-type</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Component major type</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR4</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FD0</addressOffset>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR5</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FD4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FP_PIDR5</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR6</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FP_PIDR6</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR7</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FP_PIDR7</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR0</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FE0</addressOffset>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>PART_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR1</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FE4</addressOffset>
          <resetValue>0x000000BD</resetValue>
          <fields>
            <field>
              <name>DES_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR2</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FE8</addressOffset>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEDEC</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_PIDR3</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REVAND</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_CIDR0</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FF0</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_CIDR1</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FF4</addressOffset>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>CLASS</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_CIDR2</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FF8</addressOffset>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FP_CIDR3</name>
          <description>Provides CoreSight discovery information for the FP</description>
          <addressOffset>0x2FFC</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICTR</name>
          <description>Provides information about the interrupt controller</description>
          <addressOffset>0xE004</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INTLINESNUM</name>
              <description>Indicates the number of the highest implemented register in each of the NVIC control register sets, or in the case of NVIC_IPR*n, 4×INTLINESNUM</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTLR</name>
          <description>Provides IMPLEMENTATION DEFINED configuration and control options</description>
          <addressOffset>0xE008</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTEXCLALL</name>
              <description>External Exclusives Allowed with no MPU</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISITMATBFLUSH</name>
              <description>Disable ATB Flush</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FPEXCODIS</name>
              <description>Disable FPU exception outputs</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISOOFP</name>
              <description>Disable out-of-order FP instruction completion</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISFOLD</name>
              <description>Disable dual-issue.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISMCYCINT</name>
              <description>Disable dual-issue.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CSR</name>
          <description>Use the SysTick Control and Status Register to enable the SysTick features.</description>
          <addressOffset>0xE010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNTFLAG</name>
              <description>Returns 1 if timer counted to 0 since last time this was read. Clears on read by application or debugger.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKSOURCE</name>
              <description>SysTick clock source. Always reads as one if SYST_CALIB reports NOREF. 
                            Selects the SysTick timer clock source: 
                            0 = External reference clock. 
                            1 = Processor clock.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TICKINT</name>
              <description>Enables SysTick exception request: 
                            0 = Counting down to zero does not assert the SysTick exception request. 
                            1 = Counting down to zero to asserts the SysTick exception request.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable SysTick counter: 
                            0 = Counter disabled. 
                            1 = Counter enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_RVR</name>
          <description>Use the SysTick Reload Value Register to specify the start value to load into the current value register when the counter reaches 0. It can be any value between 0 and 0x00FFFFFF. A start value of 0 is possible, but has no effect because the SysTick interrupt and COUNTFLAG are activated when counting from 1 to 0. The reset value of this register is UNKNOWN. 
                    To generate a multi-shot timer with a period of N processor clock cycles, use a RELOAD value of N-1. For example, if the SysTick interrupt is required every 100 clock pulses, set RELOAD to 99.</description>
          <addressOffset>0xE014</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>Value to load into the SysTick Current Value Register when the counter reaches 0.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CVR</name>
          <description>Use the SysTick Current Value Register to find the current value in the register. The reset value of this register is UNKNOWN.</description>
          <addressOffset>0xE018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRENT</name>
              <description>Reads return the current value of the SysTick counter. This register is write-clear. Writing to it with any value clears the register to 0. Clearing this register also clears the COUNTFLAG bit of the SysTick Control and Status Register.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CALIB</name>
          <description>Use the SysTick Calibration Value Register to enable software to scale to any required speed using divide and multiply.</description>
          <addressOffset>0xE01C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NOREF</name>
              <description>If reads as 1, the Reference clock is not provided - the CLKSOURCE bit of the SysTick Control and Status register will be forced to 1 and cannot be cleared to 0.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>If reads as 1, the calibration value for 10ms is inexact (due to clock frequency).</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TENMS</name>
              <description>An optional Reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors. If the value reads as 0, the calibration value is not known.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
