apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>NVIC_IPR10</name>
          <description>Sets or reads interrupt priorities</description>
          <addressOffset>0xE428</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR11</name>
          <description>Sets or reads interrupt priorities</description>
          <addressOffset>0xE42C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR12</name>
          <description>Sets or reads interrupt priorities</description>
          <addressOffset>0xE430</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR13</name>
          <description>Sets or reads interrupt priorities</description>
          <addressOffset>0xE434</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR14</name>
          <description>Sets or reads interrupt priorities</description>
          <addressOffset>0xE438</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR15</name>
          <description>Sets or reads interrupt priorities</description>
          <addressOffset>0xE43C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_N3</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N0</name>
              <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <description>Provides identification information for the PE, including an implementer code for the device and a device ID number</description>
          <addressOffset>0xED00</addressOffset>
          <resetValue>0x411FD210</resetValue>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>This field must hold an implementer code that has been assigned by ARM</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>IMPLEMENTATION DEFINED variant number. Typically, this field is used to distinguish between different product variants, or major revisions of a product</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHITECTURE</name>
              <description>Defines the Architecture implemented by the PE</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>IMPLEMENTATION DEFINED primary part number for the device</description>
              <bitRange>[15:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>IMPLEMENTATION DEFINED revision number for the device</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSR</name>
          <description>Controls and provides status information for NMI, PendSV, SysTick and interrupts</description>
          <addressOffset>0xED04</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PENDNMISET</name>
              <description>Indicates whether the NMI exception is pending</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDNMICLR</name>
              <description>Allows the NMI exception pend state to be cleared</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSVSET</name>
              <description>Indicates whether the PendSV `FTSSS exception is pending</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDSVCLR</name>
              <description>Allows the PendSV exception pend state to be cleared `FTSSS</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>Indicates whether the SysTick `FTSSS exception is pending</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>Allows the SysTick exception pend state to be cleared `FTSSS</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STTNS</name>
              <description>Controls whether in a single SysTick implementation, the SysTick is Secure or Non-secure</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ISRPREEMPT</name>
              <description>Indicates whether a pending exception will be serviced on exit from debug halt state</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISRPENDING</name>
              <description>Indicates whether an external interrupt, generated by the NVIC, is pending</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VECTPENDING</name>
              <description>The exception number of the highest priority pending and enabled interrupt</description>
              <bitRange>[20:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RETTOBASE</name>
              <description>In Handler mode, indicates whether there is more than one active exception</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VECTACTIVE</name>
              <description>The exception number of the current executing exception</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTOR</name>
          <description>The VTOR indicates the offset of the vector table base address from memory address 0x00000000.</description>
          <addressOffset>0xED08</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TBLOFF</name>
              <description>Vector table base offset field. It contains bits[31:7] of the offset of the table base from the bottom of the memory map.</description>
              <bitRange>[31:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AIRCR</name>
          <description>Use the Application Interrupt and Reset Control Register to: determine data endianness, clear all active state information from debug halt mode, request a system reset.</description>
          <addressOffset>0xED0C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VECTKEY</name>
              <description>Register key: 
                            Reads as Unknown 
                            On writes, write 0x05FA to VECTKEY, otherwise the write is ignored.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIANESS</name>
              <description>Data endianness implemented: 
                            0 = Little-endian.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRIS</name>
              <description>Prioritize Secure exceptions. The value of this bit defines whether Secure exception priority boosting is enabled. 
                            0	Priority ranges of Secure and Non-secure exceptions are identical. 
                            1	Non-secure exceptions are de-prioritized.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFHFNMINS</name>
              <description>BusFault, HardFault, and NMI Non-secure enable. 
                            0	BusFault, HardFault, and NMI are Secure. 
                            1	BusFault and NMI are Non-secure and exceptions can target Non-secure HardFault.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIGROUP</name>
              <description>Interrupt priority grouping field. This field determines the split of group priority from subpriority. 
                            See https://developer.arm.com/documentation/100235/0004/the-cortex-m33-peripherals/system-control-block/application-interrupt-and-reset-control-register?lang=en</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRESETREQS</name>
              <description>System reset request, Secure state only. 
                            0	SYSRESETREQ functionality is available to both Security states. 
                            1 SYSRESETREQ functionality is only available to Secure state.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSRESETREQ</name>
              <description>Writing 1 to this bit causes the SYSRESETREQ signal to the outer system to be asserted to request a reset. The intention is to force a large system reset of all major components except for debug. The C_HALT bit in the DHCSR is cleared as a result of the system reset requested. The debugger does not lose contact with the device.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VECTCLRACTIVE</name>
              <description>Clears all active state information for fixed and configurable exceptions. This bit: is self-clearing, can only be set by the DAP when the core is halted.  When set: clears all active exception status of the processor, forces a return to Thread mode, forces an IPSR of 0. A debugger must re-initialize the stack.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>System Control Register. Use the System Control Register for power-management functions: signal to the system when the processor can enter a low power state, control how the processor enters and exits low power states.</description>
          <addressOffset>0xED10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEVONPEND</name>
              <description>Send Event on Pending bit: 
                            0 = Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded. 
                            1 = Enabled events and all interrupts, including disabled interrupts, can wakeup the processor. 
                            When an event or interrupt becomes pending, the event signal wakes up the processor from WFE. If the 
                            processor is not waiting for an event, the event is registered and affects the next WFE. 
                            The processor also wakes up on execution of an SEV instruction or an external event.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPDEEPS</name>
              <description>0 SLEEPDEEP is available to both security states 
                            1 SLEEPDEEP is only available to Secure state</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>Controls whether the processor uses sleep or deep sleep as its low power mode: 
                            0 = Sleep. 
                            1 = Deep sleep.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPONEXIT</name>
              <description>Indicates sleep-on-exit when returning from Handler mode to Thread mode: 
                            0 = Do not sleep when returning to Thread mode. 
                            1 = Enter sleep, or deep sleep, on return from an ISR to Thread mode. 
                            Setting this bit to 1 enables an interrupt driven application to avoid returning to an empty main application.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
