apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>CCR</name>
          <description>Sets or returns configuration and control data</description>
          <addressOffset>0xED14</addressOffset>
          <resetValue>0x00000201</resetValue>
          <fields>
            <field>
              <name>BP</name>
              <description>Enables program flow prediction `FTSSS</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IC</name>
              <description>This is a global enable bit for instruction caches in the selected Security state</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DC</name>
              <description>Enables data caching of all data accesses to Normal memory `FTSSS</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STKOFHFNMIGN</name>
              <description>Controls the effect of a stack limit violation while executing at a requested priority less than 0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RES1</name>
              <description>Reserved, RES1</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BFHFNMIGN</name>
              <description>Determines the effect of precise BusFaults on handlers running at a requested priority less than 0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV_0_TRP</name>
              <description>Controls the generation of a DIVBYZERO UsageFault when attempting to perform integer division by zero</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNALIGN_TRP</name>
              <description>Controls the trapping of unaligned word or halfword accesses</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USERSETMPEND</name>
              <description>Determines whether unprivileged accesses are permitted to pend interrupts via the STIR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RES1_1</name>
              <description>Reserved, RES1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR1</name>
          <description>Sets or returns priority for system handlers 4 - 7</description>
          <addressOffset>0xED18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_7_3</name>
              <description>Priority of system handler 7, SecureFault</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_6_3</name>
              <description>Priority of system handler 6, SecureFault</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_5_3</name>
              <description>Priority of system handler 5, SecureFault</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_4_3</name>
              <description>Priority of system handler 4, SecureFault</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR2</name>
          <description>Sets or returns priority for system handlers 8 - 11</description>
          <addressOffset>0xED1C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_11_3</name>
              <description>Priority of system handler 11, SecureFault</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_10</name>
              <description>Reserved, RES0</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRI_9</name>
              <description>Reserved, RES0</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRI_8</name>
              <description>Reserved, RES0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR3</name>
          <description>Sets or returns priority for system handlers 12 - 15</description>
          <addressOffset>0xED20</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_15_3</name>
              <description>Priority of system handler 15, SecureFault</description>
              <bitRange>[31:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_14_3</name>
              <description>Priority of system handler 14, SecureFault</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_13</name>
              <description>Reserved, RES0</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRI_12_3</name>
              <description>Priority of system handler 12, SecureFault</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHCSR</name>
          <description>Provides access to the active and pending status of system exceptions</description>
          <addressOffset>0xED24</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HARDFAULTPENDED</name>
              <description>`IAAMO the pending state of the HardFault exception `CTTSSS</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SECUREFAULTPENDED</name>
              <description>`IAAMO the pending state of the SecureFault exception</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SECUREFAULTENA</name>
              <description>`DW the SecureFault exception is enabled</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USGFAULTENA</name>
              <description>`DW the UsageFault exception is enabled `FTSSS</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSFAULTENA</name>
              <description>`DW the BusFault exception is enabled</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MEMFAULTENA</name>
              <description>`DW the MemManage exception is enabled `FTSSS</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SVCALLPENDED</name>
              <description>`IAAMO the pending state of the SVCall exception `FTSSS</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSFAULTPENDED</name>
              <description>`IAAMO the pending state of the BusFault exception</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MEMFAULTPENDED</name>
              <description>`IAAMO the pending state of the MemManage exception `FTSSS</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USGFAULTPENDED</name>
              <description>The UsageFault exception is banked between Security states, `IAAMO the pending state of the UsageFault exception `FTSSS</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTICKACT</name>
              <description>`IAAMO the active state of the SysTick exception `FTSSS</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDSVACT</name>
              <description>`IAAMO the active state of the PendSV exception `FTSSS</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MONITORACT</name>
              <description>`IAAMO the active state of the DebugMonitor exception</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SVCALLACT</name>
              <description>`IAAMO the active state of the SVCall exception `FTSSS</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIACT</name>
              <description>`IAAMO the active state of the NMI exception</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SECUREFAULTACT</name>
              <description>`IAAMO the active state of the SecureFault exception</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USGFAULTACT</name>
              <description>`IAAMO the active state of the UsageFault exception `FTSSS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HARDFAULTACT</name>
              <description>Indicates and allows limited modification of the active state of the HardFault exception `FTSSS</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSFAULTACT</name>
              <description>`IAAMO the active state of the BusFault exception</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MEMFAULTACT</name>
              <description>`IAAMO the active state of the MemManage exception `FTSSS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFSR</name>
          <description>Contains the three Configurable Fault Status Registers.

                    31:16 UFSR: Provides information on UsageFault exceptions

