apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    15:8 BFSR: Provides information on BusFault exceptions

                    7:0 MMFSR: Provides information on MemManage exceptions</description>
          <addressOffset>0xED28</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UFSR_DIVBYZERO</name>
              <description>Sticky flag indicating whether an integer division by zero error has occurred</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFSR_UNALIGNED</name>
              <description>Sticky flag indicating whether an unaligned access error has occurred</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFSR_STKOF</name>
              <description>Sticky flag indicating whether a stack overflow error has occurred</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFSR_NOCP</name>
              <description>Sticky flag indicating whether a coprocessor disabled or not present error has occurred</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFSR_INVPC</name>
              <description>Sticky flag indicating whether an integrity check error has occurred</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFSR_INVSTATE</name>
              <description>Sticky flag indicating whether an EPSR.T or EPSR.IT validity error has occurred</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFSR_UNDEFINSTR</name>
              <description>Sticky flag indicating whether an undefined instruction error has occurred</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFSR_BFARVALID</name>
              <description>Indicates validity of the contents of the BFAR register</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFSR_LSPERR</name>
              <description>Records whether a BusFault occurred during FP lazy state preservation</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFSR_STKERR</name>
              <description>Records whether a derived BusFault occurred during exception entry stacking</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFSR_UNSTKERR</name>
              <description>Records whether a derived BusFault occurred during exception return unstacking</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFSR_IMPRECISERR</name>
              <description>Records whether an imprecise data access error has occurred</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFSR_PRECISERR</name>
              <description>Records whether a precise data access error has occurred</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFSR_IBUSERR</name>
              <description>Records whether a BusFault on an instruction prefetch has occurred</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MMFSR</name>
              <description>Provides information on MemManage exceptions</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFSR</name>
          <description>Shows the cause of any HardFaults</description>
          <addressOffset>0xED2C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEBUGEVT</name>
              <description>Indicates when a Debug event has occurred</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCED</name>
              <description>Indicates that a fault with configurable priority has been escalated to a HardFault exception, because it could not be made active, because of priority, or because it was disabled</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VECTTBL</name>
              <description>Indicates when a fault has occurred because of a vector table read error on exception processing</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSR</name>
          <description>Shows which debug event occurred</description>
          <addressOffset>0xED30</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTERNAL</name>
              <description>Sticky flag indicating whether an External debug request debug event has occurred</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCATCH</name>
              <description>Sticky flag indicating whether a Vector catch debug event has occurred</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWTTRAP</name>
              <description>Sticky flag indicating whether a Watchpoint debug event has occurred</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPT</name>
              <description>Sticky flag indicating whether a Breakpoint debug event has occurred</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HALTED</name>
              <description>Sticky flag indicating that a Halt request debug event or Step debug event has occurred</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMFAR</name>
          <description>Shows the address of the memory location that caused an MPU fault</description>
          <addressOffset>0xED34</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>This register is updated with the address of a location that produced a MemManage fault. The MMFSR shows the cause of the fault, and whether this field is valid. This field is valid only when MMFSR.MMARVALID is set, otherwise it is UNKNOWN</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BFAR</name>
          <description>Shows the address associated with a precise data access BusFault</description>
          <addressOffset>0xED38</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>This register is updated with the address of a location that produced a BusFault. The BFSR shows the reason for the fault. This field is valid only when BFSR.BFARVALID is set, otherwise it is UNKNOWN</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR0</name>
          <description>Gives top-level information about the instruction set supported by the PE</description>
          <addressOffset>0xED40</addressOffset>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>STATE1</name>
              <description>T32 instruction set support</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE0</name>
              <description>A32 instruction set support</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR1</name>
          <description>Gives information about the programmers' model and Extensions support</description>
          <addressOffset>0xED44</addressOffset>
          <resetValue>0x00000520</resetValue>
          <fields>
            <field>
              <name>MPROGMOD</name>
              <description>Identifies support for the M-Profile programmers' model support</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURITY</name>
              <description>Identifies whether the Security Extension is implemented</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_DFR0</name>
          <description>Provides top level information about the debug system</description>
          <addressOffset>0xED48</addressOffset>
          <resetValue>0x00200000</resetValue>
          <fields>
            <field>
              <name>MPROFDBG</name>
              <description>Indicates the supported M-profile debug architecture</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_AFR0</name>
          <description>Provides information about the IMPLEMENTATION DEFINED features of the PE</description>
          <addressOffset>0xED4C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IMPDEF3</name>
              <description>IMPLEMENTATION DEFINED meaning</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPDEF2</name>
              <description>IMPLEMENTATION DEFINED meaning</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPDEF1</name>
              <description>IMPLEMENTATION DEFINED meaning</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPDEF0</name>
              <description>IMPLEMENTATION DEFINED meaning</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR0</name>
          <description>Provides information about the implemented memory model and memory management support</description>
          <addressOffset>0xED50</addressOffset>
          <resetValue>0x00101F40</resetValue>
          <fields>
            <field>
              <name>AUXREG</name>
              <description>Indicates support for Auxiliary Control Registers</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCM</name>
              <description>Indicates support for tightly coupled memories (TCMs)</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SHARELVL</name>
              <description>Indicates the number of shareability levels implemented</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTERSHR</name>
              <description>Indicates the outermost shareability domain implemented</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PMSA</name>
              <description>Indicates support for the protected memory system architecture (PMSA)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR1</name>
          <description>Provides information about the implemented memory model and memory management support</description>
          <addressOffset>0xED54</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID_MMFR1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR2</name>
          <description>Provides information about the implemented memory model and memory management support</description>
          <addressOffset>0xED58</addressOffset>
          <resetValue>0x01000000</resetValue>
          <fields>
            <field>
              <name>WFISTALL</name>
              <description>Indicates the support for Wait For Interrupt (WFI) stalling</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR3</name>
          <description>Provides information about the implemented memory model and memory management support</description>
          <addressOffset>0xED5C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BPMAINT</name>
              <description>Indicates the supported branch predictor maintenance</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMAINTSW</name>
              <description>Indicates the supported cache maintenance operations by set/way</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMAINTVA</name>
              <description>Indicates the supported cache maintenance operations by address</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR0</name>
          <description>Provides information about the instruction set implemented by the PE</description>
          <addressOffset>0xED60</addressOffset>
          <resetValue>0x08092300</resetValue>
          <fields>
            <field>
              <name>DIVIDE</name>
              <description>Indicates the supported Divide instructions</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG</name>
              <description>Indicates the implemented Debug instructions</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COPROC</name>
              <description>Indicates the supported Coprocessor instructions</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPBRANCH</name>
              <description>Indicates the supported combined Compare and Branch instructions</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BITFIELD</name>
              <description>Indicates the supported bit field instructions</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BITCOUNT</name>
              <description>Indicates the supported bit count instructions</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR1</name>
          <description>Provides information about the instruction set implemented by the PE</description>
          <addressOffset>0xED64</addressOffset>
          <resetValue>0x05725000</resetValue>
          <fields>
            <field>
              <name>INTERWORK</name>
              <description>Indicates the implemented Interworking instructions</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IMMEDIATE</name>
              <description>Indicates the implemented for data-processing instructions with long immediates</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IFTHEN</name>
              <description>Indicates the implemented If-Then instructions</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTEND</name>
              <description>Indicates the implemented Extend instructions</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR2</name>
          <description>Provides information about the instruction set implemented by the PE</description>
          <addressOffset>0xED68</addressOffset>
          <resetValue>0x30173426</resetValue>
          <fields>
            <field>
              <name>REVERSAL</name>
              <description>Indicates the implemented Reversal instructions</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTU</name>
              <description>Indicates the implemented advanced unsigned Multiply instructions</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTS</name>
              <description>Indicates the implemented advanced signed Multiply instructions</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MULT</name>
              <description>Indicates the implemented additional Multiply instructions</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTIACCESSINT</name>
              <description>Indicates the support for interruptible multi-access instructions</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MEMHINT</name>
              <description>Indicates the implemented Memory Hint instructions</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOADSTORE</name>
              <description>Indicates the implemented additional load/store instructions</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_ISAR3</name>
          <description>Provides information about the instruction set implemented by the PE</description>
          <addressOffset>0xED6C</addressOffset>
          <resetValue>0x07895729</resetValue>
          <fields>
            <field>
              <name>TRUENOP</name>
              <description>Indicates the implemented true NOP instructions</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>T32COPY</name>
              <description>Indicates the support for T32 non flag-setting MOV instructions</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TABBRANCH</name>
              <description>Indicates the implemented Table Branch instructions</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCHPRIM</name>
              <description>Used in conjunction with ID_ISAR4.SynchPrim_frac to indicate the implemented Synchronization Primitive instructions</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SVC</name>
              <description>Indicates the implemented SVC instructions</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SIMD</name>
              <description>Indicates the implemented SIMD instructions</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SATURATE</name>
              <description>Indicates the implemented saturating instructions</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
