apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>MPU_MAIR0</name>
          <description>Along with MPU_MAIR1, provides the memory attribute encodings corresponding to the AttrIndex values</description>
          <addressOffset>0xEDC0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATTR3</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 3</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR2</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 2</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR1</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 1</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR0</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_MAIR1</name>
          <description>Along with MPU_MAIR0, provides the memory attribute encodings corresponding to the AttrIndex values</description>
          <addressOffset>0xEDC4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATTR7</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 7</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR6</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 6</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR5</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 5</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATTR4</name>
              <description>Memory attribute encoding for MPU regions with an AttrIndex of 4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAU_CTRL</name>
          <description>Allows enabling of the Security Attribution Unit</description>
          <addressOffset>0xEDD0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALLNS</name>
              <description>When SAU_CTRL.ENABLE is 0 this bit controls if the memory is marked as Non-secure or Secure</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enables the SAU</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAU_TYPE</name>
          <description>Indicates the number of regions implemented by the Security Attribution Unit</description>
          <addressOffset>0xEDD4</addressOffset>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>SREGION</name>
              <description>The number of implemented SAU regions</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAU_RNR</name>
          <description>Selects the region currently accessed by SAU_RBAR and SAU_RLAR</description>
          <addressOffset>0xEDD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REGION</name>
              <description>Indicates the SAU region accessed by SAU_RBAR and SAU_RLAR</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAU_RBAR</name>
          <description>Provides indirect read and write access to the base address of the currently selected SAU region</description>
          <addressOffset>0xEDDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BADDR</name>
              <description>Holds bits [31:5] of the base address for the selected SAU region</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAU_RLAR</name>
          <description>Provides indirect read and write access to the limit address of the currently selected SAU region</description>
          <addressOffset>0xEDE0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LADDR</name>
              <description>Holds bits [31:5] of the limit address for the selected SAU region</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSC</name>
              <description>Controls whether Non-secure state is permitted to execute an SG instruction from this region</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>SAU region enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFSR</name>
          <description>Provides information about any security related faults</description>
          <addressOffset>0xEDE4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSERR</name>
              <description>Sticky flag indicating that an error occurred during lazy state activation or deactivation</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFARVALID</name>
              <description>This bit is set when the SFAR register contains a valid value. As with similar fields, such as BFSR.BFARVALID and MMFSR.MMARVALID, this bit can be cleared by other exceptions, such as BusFault</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPERR</name>
              <description>Stick flag indicating that an SAU or IDAU violation occurred during the lazy preservation of floating-point state</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVTRAN</name>
              <description>Sticky flag indicating that an exception was raised due to a branch that was not flagged as being domain crossing causing a transition from Secure to Non-secure memory</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUVIOL</name>
              <description>Sticky flag indicating that an attempt was made to access parts of the address space that are marked as Secure with NS-Req for the transaction set to Non-secure. This bit is not set if the violation occurred during lazy state preservation. See LSPERR</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVER</name>
              <description>This can be caused by EXC_RETURN.DCRS being set to 0 when returning from an exception in the Non-secure state, or by EXC_RETURN.ES being set to 1 when returning from an exception in the Non-secure state</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVIS</name>
              <description>This bit is set if the integrity signature in an exception stack frame is found to be invalid during the unstacking operation</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INVEP</name>
              <description>This bit is set if a function call from the Non-secure state or exception targets a non-SG instruction in the Secure state. This bit is also set if the target address is a SG instruction, but there is no matching SAU/IDAU region with the NSC flag set</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SFAR</name>
          <description>Shows the address of the memory location that caused a Security violation</description>
          <addressOffset>0xEDE8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>The address of an access that caused a attribution unit violation. This field is only valid when SFSR.SFARVALID is set. This allows the actual flip flops associated with this register to be shared with other fault address registers. If an implementation chooses to share the storage in this way, care must be taken to not leak Secure address information to the Non-secure state. One way of achieving this is to share the SFAR register with the MMFAR_S register, which is not accessible to the Non-secure state</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHCSR</name>
          <description>Controls halting debug</description>
          <addressOffset>0xEDF0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S_RESTART_ST</name>
              <description>Indicates the PE has processed a request to clear DHCSR.C_HALT to 0. That is, either a write to DHCSR that clears DHCSR.C_HALT from 1 to 0, or an External Restart Request</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_RESET_ST</name>
              <description>Indicates whether the PE has been reset since the last read of the DHCSR</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_RETIRE_ST</name>
              <description>Set to 1 every time the PE retires one of more instructions</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_SDE</name>
              <description>Indicates whether Secure invasive debug is allowed</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_LOCKUP</name>
              <description>Indicates whether the PE is in Lockup state</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_SLEEP</name>
              <description>Indicates whether the PE is sleeping</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_HALT</name>
              <description>Indicates whether the PE is in Debug state</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>S_REGRDY</name>
              <description>Handshake flag to transfers through the DCRDR</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>C_SNAPSTALL</name>
              <description>Allow imprecise entry to Debug state</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C_MASKINTS</name>
              <description>When debug is enabled, the debugger can write to this bit to mask PendSV, SysTick and external configurable interrupts</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C_STEP</name>
              <description>Enable single instruction step</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C_HALT</name>
              <description>PE enter Debug state halt request</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>C_DEBUGEN</name>
              <description>Enable Halting debug</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRSR</name>
          <description>With the DCRDR, provides debug access to the general-purpose registers, special-purpose registers, and the FP extension registers. A write to the DCRSR specifies the register to transfer, whether the transfer is a read or write, and starts the transfer</description>
          <addressOffset>0xEDF4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REGWNR</name>
              <description>Specifies the access type for the transfer</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REGSEL</name>
              <description>Specifies the general-purpose register, special-purpose register, or FP register to transfer</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRDR</name>
          <description>With the DCRSR, provides debug access to the general-purpose registers, special-purpose registers, and the FP Extension registers. If the Main Extension is implemented, it can also be used for message passing between an external debugger and a debug agent running on the PE</description>
          <addressOffset>0xEDF8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBGTMP</name>
              <description>Provides debug access for reading and writing the general-purpose registers, special-purpose registers, and Floating-point Extension registers</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMCR</name>
          <description>Manages vector catch behavior and DebugMonitor handling when debugging</description>
          <addressOffset>0xEDFC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRCENA</name>
              <description>Global enable for all DWT and ITM features</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SDME</name>
              <description>Indicates whether the DebugMonitor targets the Secure or the Non-secure state and whether debug events are allowed in Secure state</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MON_REQ</name>
              <description>DebugMonitor semaphore bit</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MON_STEP</name>
              <description>Enable DebugMonitor stepping</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MON_PEND</name>
              <description>Sets or clears the pending state of the DebugMonitor exception</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MON_EN</name>
              <description>Enable the DebugMonitor exception</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_SFERR</name>
              <description>SecureFault exception halting debug vector catch enable</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_HARDERR</name>
              <description>HardFault exception halting debug vector catch enable</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_INTERR</name>
              <description>Enable halting debug vector catch for faults during exception entry and return</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_BUSERR</name>
              <description>BusFault exception halting debug vector catch enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_STATERR</name>
              <description>Enable halting debug trap on a UsageFault exception caused by a state information error, for example an Undefined Instruction exception</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_CHKERR</name>
              <description>Enable halting debug trap on a UsageFault exception caused by a checking error, for example an alignment check error</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_NOCPERR</name>
              <description>Enable halting debug trap on a UsageFault caused by an access to a coprocessor</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_MMERR</name>
              <description>Enable halting debug trap on a MemManage exception</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VC_CORERESET</name>
              <description>Enable Reset Vector Catch. This causes a warm reset to halt a running system</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSCSR</name>
          <description>Provides control and status information for Secure debug</description>
          <addressOffset>0xEE08</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDSKEY</name>
              <description>Writes to the CDS bit are ignored unless CDSKEY is concurrently written to zero</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CDS</name>
              <description>This field indicates the current Security state of the processor</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SBRSEL</name>
              <description>If SBRSELEN is 1 this bit selects whether the Non-secure or the Secure version of the memory-mapped Banked registers are accessible to the debugger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SBRSELEN</name>
              <description>Controls whether the SBRSEL field or the current Security state of the processor selects which version of the memory-mapped Banked registers are accessed to the debugger</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STIR</name>
          <description>Provides a mechanism for software to generate an interrupt</description>
          <addressOffset>0xEF00</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTID</name>
              <description>Indicates the interrupt to be pended. The value written is (ExceptionNumber - 16)</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
