apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>FPCCR</name>
          <description>Holds control data for the Floating-point extension</description>
          <addressOffset>0xEF34</addressOffset>
          <resetValue>0x20000472</resetValue>
          <fields>
            <field>
              <name>ASPEN</name>
              <description>When this bit is set to 1, execution of a floating-point instruction sets the CONTROL.FPCA bit to 1</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPEN</name>
              <description>Enables lazy context save of floating-point state</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPENS</name>
              <description>This bit controls whether the LSPEN bit is writeable from the Non-secure state</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRONRET</name>
              <description>Clear floating-point caller saved registers on exception return</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLRONRETS</name>
              <description>This bit controls whether the CLRONRET bit is writeable from the Non-secure state</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TS</name>
              <description>Treat floating-point registers as Secure enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UFRDY</name>
              <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the UsageFault exception to pending</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPLIMVIOL</name>
              <description>This bit is banked between the Security states and indicates whether the floating-point context violates the stack pointer limit that was active when lazy state preservation was activated. SPLIMVIOL modifies the lazy floating-point state preservation behavior</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MONRDY</name>
              <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the DebugMonitor exception to pending</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SFRDY</name>
              <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the SecureFault exception to pending. This bit is only present in the Secure version of the register, and behaves as RAZ/WI when accessed from the Non-secure state</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BFRDY</name>
              <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the BusFault exception to pending</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MMRDY</name>
              <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the MemManage exception to pending</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HFRDY</name>
              <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the HardFault exception to pending</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>THREAD</name>
              <description>Indicates the PE mode when it allocated the floating-point stack frame</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>Security status of the floating-point context. This bit is only present in the Secure version of the register, and behaves as RAZ/WI when accessed from the Non-secure state. This bit is updated whenever lazy state preservation is activated, or when a floating-point instruction is executed</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USER</name>
              <description>Indicates the privilege level of the software executing when the PE allocated the floating-point stack frame</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPACT</name>
              <description>Indicates whether lazy preservation of the floating-point state is active</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCAR</name>
          <description>Holds the location of the unpopulated floating-point register space allocated on an exception stack frame</description>
          <addressOffset>0xEF38</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>The location of the unpopulated floating-point register space allocated on an exception stack frame</description>
              <bitRange>[31:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPDSCR</name>
          <description>Holds the default values for the floating-point status control data that the PE assigns to the FPSCR when it creates a new floating-point context</description>
          <addressOffset>0xEF3C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AHP</name>
              <description>Default value for FPSCR.AHP</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DN</name>
              <description>Default value for FPSCR.DN</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FZ</name>
              <description>Default value for FPSCR.FZ</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RMODE</name>
              <description>Default value for FPSCR.RMode</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR0</name>
          <description>Describes the features provided by the Floating-point Extension</description>
          <addressOffset>0xEF40</addressOffset>
          <resetValue>0x60540601</resetValue>
          <fields>
            <field>
              <name>FPROUND</name>
              <description>Indicates the rounding modes supported by the FP Extension</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPSQRT</name>
              <description>Indicates the support for FP square root operations</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDIVIDE</name>
              <description>Indicates the support for FP divide operations</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDP</name>
              <description>Indicates support for FP double-precision operations</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPSP</name>
              <description>Indicates support for FP single-precision operations</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SIMDREG</name>
              <description>Indicates size of FP register file</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR1</name>
          <description>Describes the features provided by the Floating-point Extension</description>
          <addressOffset>0xEF44</addressOffset>
          <resetValue>0x85000089</resetValue>
          <fields>
            <field>
              <name>FMAC</name>
              <description>Indicates whether the FP Extension implements the fused multiply accumulate instructions</description>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPHP</name>
              <description>Indicates whether the FP Extension implements half-precision FP conversion instructions</description>
              <bitRange>[27:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPDNAN</name>
              <description>Indicates whether the FP hardware implementation supports NaN propagation</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPFTZ</name>
              <description>Indicates whether subnormals are always flushed-to-zero</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR2</name>
          <description>Describes the features provided by the Floating-point Extension</description>
          <addressOffset>0xEF48</addressOffset>
          <resetValue>0x00000060</resetValue>
          <fields>
            <field>
              <name>FPMISC</name>
              <description>Indicates support for miscellaneous FP features</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDEVARCH</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFBC</addressOffset>
          <resetValue>0x47702A04</resetValue>
          <fields>
            <field>
              <name>ARCHITECT</name>
              <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
              <bitRange>[31:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>Defines that the DEVARCH register is present</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Defines the architecture revision of the component</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHVER</name>
              <description>Defines the architecture version of the component</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHPART</name>
              <description>Defines the architecture of the component</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDEVTYPE</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFCC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUB</name>
              <description>Component sub-type</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>CoreSight major type</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR4</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFD0</addressOffset>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR5</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFD4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPIDR5</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR6</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPIDR6</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR7</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPIDR7</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR0</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFE0</addressOffset>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>PART_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR1</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFE4</addressOffset>
          <resetValue>0x000000BD</resetValue>
          <fields>
            <field>
              <name>DES_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR2</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFE8</addressOffset>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEDEC</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIDR3</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REVAND</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCIDR0</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFF0</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCIDR1</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFF4</addressOffset>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>CLASS</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCIDR2</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFF8</addressOffset>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCIDR3</name>
          <description>Provides CoreSight discovery information for the SCS</description>
          <addressOffset>0xEFFC</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>See CoreSight Architecture Specification</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCPRGCTLR</name>
          <description>Programming Control Register</description>
          <addressOffset>0x41004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Trace Unit Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCSTATR</name>
          <description>The TRCSTATR indicates the ETM-Teal status</description>
          <addressOffset>0x4100C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMSTABLE</name>
              <description>Indicates whether the ETM-Teal registers are stable and can be read</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>Indicates that the trace unit is inactive</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
