apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>TRCCONFIGR</name>
          <description>The TRCCONFIGR sets the basic tracing options for the trace unit</description>
          <addressOffset>0x41010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RS</name>
              <description>Return stack enable</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TS</name>
              <description>Global timestamp tracing</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COND</name>
              <description>Conditional instruction tracing</description>
              <bitRange>[10:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCI</name>
              <description>Cycle counting in instruction trace</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BB</name>
              <description>Branch broadcast mode</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCEVENTCTL0R</name>
          <description>The TRCEVENTCTL0R controls the tracing of events in the trace stream. The events also drive the ETM-Teal external outputs.</description>
          <addressOffset>0x41020</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TYPE1</name>
              <description>Selects the resource type for event 1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL1</name>
              <description>Selects the resource number, based on the value of TYPE1: When TYPE1 is 0, selects a single selected resource from 0-15 defined by SEL1[2:0].  When TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by SEL1[2:0]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE0</name>
              <description>Selects the resource type for event 0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL0</name>
              <description>Selects the resource number, based on the value of TYPE0: When TYPE1 is 0, selects a single selected resource from 0-15 defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by SEL0[2:0]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCEVENTCTL1R</name>
          <description>The TRCEVENTCTL1R controls how the events selected by TRCEVENTCTL0R behave</description>
          <addressOffset>0x41024</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPOVERRIDE</name>
              <description>Low power state behavior override</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATB</name>
              <description>ATB enabled</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTEN1</name>
              <description>One bit per event, to enable generation of an event element in the instruction trace stream when the selected event occurs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INSTEN0</name>
              <description>One bit per event, to enable generation of an event element in the instruction trace stream when the selected event occurs</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCSTALLCTLR</name>
          <description>The TRCSTALLCTLR enables ETM-Teal to stall the processor if the ETM-Teal FIFO goes over the programmed level to minimize risk of overflow</description>
          <addressOffset>0x4102C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSTPRIORITY</name>
              <description>Reserved, RES0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ISTALL</name>
              <description>Stall processor based on instruction trace buffer space</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL</name>
              <description>Threshold at which stalling becomes active. This provides four levels. This level can be varied to optimize the level of invasion caused by stalling, balanced against the risk of a FIFO overflow</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCTSCTLR</name>
          <description>The TRCTSCTLR controls the insertion of global timestamps into the trace stream. A timestamp is always inserted into the instruction trace stream</description>
          <addressOffset>0x41030</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TYPE0</name>
              <description>Selects the resource type for event 0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL0</name>
              <description>Selects the resource number, based on the value of TYPE0: When TYPE1 is 0, selects a single selected resource from 0-15 defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by SEL0[2:0]</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCSYNCPR</name>
          <description>The TRCSYNCPR specifies the period of trace synchronization of the trace streams. TRCSYNCPR defines a number of bytes of trace between requests for trace synchronization. This value is always a power of two</description>
          <addressOffset>0x41034</addressOffset>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Defines the number of bytes of trace between trace synchronization requests as a total of the number of bytes generated by the instruction stream. The number of bytes is 2N where N is the value of this field: - A value of zero disables these periodic trace synchronization requests, but does not disable other trace synchronization requests.  - The minimum value that can be programmed, other than zero, is 8, providing a minimum trace synchronization period of 256 bytes.  - The maximum value is 20, providing a maximum trace synchronization period of 2^20 bytes</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCCCTLR</name>
          <description>The TRCCCCTLR sets the threshold value for instruction trace cycle counting. The threshold represents the minimum interval between cycle count trace packets</description>
          <addressOffset>0x41038</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <description>Instruction trace cycle count threshold</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCVICTLR</name>
          <description>The TRCVICTLR controls instruction trace filtering</description>
          <addressOffset>0x41080</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXLEVEL_S3</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding exception level</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXLEVEL_S0</name>
              <description>In Secure state, each bit controls whether instruction tracing is enabled for the corresponding exception level</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCERR</name>
              <description>Selects whether a system error exception must always be traced</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCRESET</name>
              <description>Selects whether a reset exception must always be traced</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SSSTATUS</name>
              <description>Indicates the current status of the start/stop logic</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE0</name>
              <description>Selects the resource type for event 0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL0</name>
              <description>Selects the resource number, based on the value of TYPE0: When TYPE1 is 0, selects a single selected resource from 0-15 defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by SEL0[2:0]</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCNTRLDVR0</name>
          <description>The TRCCNTRLDVR defines the reload value for the reduced function counter</description>
          <addressOffset>0x41140</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Defines the reload value for the counter. This value is loaded into the counter each time the reload event occurs</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR8</name>
          <description>TRCIDR8</description>
          <addressOffset>0x41180</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAXSPEC</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR9</name>
          <description>TRCIDR9</description>
          <addressOffset>0x41184</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NUMP0KEY</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR10</name>
          <description>TRCIDR10</description>
          <addressOffset>0x41188</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NUMP1KEY</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR11</name>
          <description>TRCIDR11</description>
          <addressOffset>0x4118C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NUMP1SPC</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR12</name>
          <description>TRCIDR12</description>
          <addressOffset>0x41190</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>NUMCONDKEY</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR13</name>
          <description>TRCIDR13</description>
          <addressOffset>0x41194</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NUMCONDSPC</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIMSPEC</name>
          <description>The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features, and enables any features that are provided</description>
          <addressOffset>0x411C0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUPPORT</name>
              <description>Reserved, RES0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR0</name>
          <description>TRCIDR0</description>
          <addressOffset>0x411E0</addressOffset>
          <resetValue>0x280006E1</resetValue>
          <fields>
            <field>
              <name>COMMOPT</name>
              <description>reads as `ImpDef</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSSIZE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[28:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCEXDATA</name>
              <description>reads as `ImpDef</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QSUPP</name>
              <description>reads as `ImpDef</description>
              <bitRange>[16:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>QFILT</name>
              <description>reads as `ImpDef</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CONDTYPE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[13:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMEVENT</name>
              <description>reads as `ImpDef</description>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RETSTACK</name>
              <description>reads as `ImpDef</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCCCI</name>
              <description>reads as `ImpDef</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCCOND</name>
              <description>reads as `ImpDef</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCBB</name>
              <description>reads as `ImpDef</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCDATA</name>
              <description>reads as `ImpDef</description>
              <bitRange>[4:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INSTP0</name>
              <description>reads as `ImpDef</description>
              <bitRange>[2:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RES1</name>
              <description>Reserved, RES1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR1</name>
          <description>TRCIDR1</description>
          <addressOffset>0x411E4</addressOffset>
          <resetValue>0x4100F421</resetValue>
          <fields>
            <field>
              <name>DESIGNER</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RES1</name>
              <description>Reserved, RES1</description>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCARCHMAJ</name>
              <description>reads as 0b0100</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCARCHMIN</name>
              <description>reads as 0b0000</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>reads as `ImpDef</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR2</name>
          <description>TRCIDR2</description>
          <addressOffset>0x411E8</addressOffset>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>CCSIZE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[28:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DVSIZE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[24:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DASIZE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[19:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VMIDSIZE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[14:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CIDSIZE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[9:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IASIZE</name>
              <description>reads as `ImpDef</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCIDR3</name>
          <description>TRCIDR3</description>
          <addressOffset>0x411EC</addressOffset>
          <resetValue>0x0F090004</resetValue>
          <fields>
            <field>
              <name>NOOVERFLOW</name>
              <description>reads as `ImpDef</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMPROC</name>
              <description>reads as `ImpDef</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSSTALL</name>
              <description>reads as `ImpDef</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLCTL</name>
              <description>reads as `ImpDef</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCPR</name>
              <description>reads as `ImpDef</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCERR</name>
              <description>reads as `ImpDef</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXLEVEL_NS</name>
              <description>reads as `ImpDef</description>
              <bitRange>[23:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXLEVEL_S</name>
              <description>reads as `ImpDef</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CCITMIN</name>
              <description>reads as `ImpDef</description>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
