apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>TRCPIDR3</name>
          <description>TRCPIDR3</description>
          <addressOffset>0x41FEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REVAND</name>
              <description>reads as `ImpDef</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>reads as `ImpDef</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCIDR0</name>
          <description>TRCCIDR0</description>
          <addressOffset>0x41FF0</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>reads as 0b00001101</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCIDR1</name>
          <description>TRCCIDR1</description>
          <addressOffset>0x41FF4</addressOffset>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>CLASS</name>
              <description>reads as 0b1001</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>reads as 0b0000</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCIDR2</name>
          <description>TRCCIDR2</description>
          <addressOffset>0x41FF8</addressOffset>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>reads as 0b00000101</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCCIDR3</name>
          <description>TRCCIDR3</description>
          <addressOffset>0x41FFC</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>reads as 0b10110001</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTICONTROL</name>
          <description>CTI Control Register</description>
          <addressOffset>0x42000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GLBEN</name>
              <description>Enables or disables the CTI</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINTACK</name>
          <description>CTI Interrupt Acknowledge Register</description>
          <addressOffset>0x42010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTACK</name>
              <description>Acknowledges the corresponding ctitrigout output. There is one bit of the register for each ctitrigout output. When a 1 is written to a bit in this register, the corresponding ctitrigout is acknowledged, causing it to be cleared.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPSET</name>
          <description>CTI Application Trigger Set Register</description>
          <addressOffset>0x42014</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APPSET</name>
              <description>Setting a bit HIGH generates a channel event for the selected channel. There is one bit of the register for each channel</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPCLEAR</name>
          <description>CTI Application Trigger Clear Register</description>
          <addressOffset>0x42018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APPCLEAR</name>
              <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIAPPPULSE</name>
          <description>CTI Application Pulse Register</description>
          <addressOffset>0x4201C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APPULSE</name>
              <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN0</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x42020</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN1</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x42024</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN2</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x42028</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN3</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x4202C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN4</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x42030</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN5</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x42034</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN6</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x42038</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIINEN7</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x4203C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINEN</name>
              <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN0</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420A0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN1</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420A4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN2</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420A8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN3</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420AC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN4</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420B0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN5</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420B4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN6</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420B8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIOUTEN7</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x420BC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTEN</name>
              <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTITRIGINSTATUS</name>
          <description>CTI Trigger to Channel Enable Registers</description>
          <addressOffset>0x42130</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGINSTATUS</name>
              <description>Shows the status of the ctitrigin inputs. There is one bit of the field for each trigger input.Because the register provides a view of the raw ctitrigin inputs, the reset value is UNKNOWN.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTITRIGOUTSTATUS</name>
          <description>CTI Trigger In Status Register</description>
          <addressOffset>0x42134</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIGOUTSTATUS</name>
              <description>Shows the status of the ctitrigout outputs. There is one bit of the field for each trigger output.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTICHINSTATUS</name>
          <description>CTI Channel In Status Register</description>
          <addressOffset>0x42138</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTICHOUTSTATUS</name>
              <description>Shows the status of the ctichout outputs. There is one bit of the field for each channel output</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTIGATE</name>
          <description>Enable CTI Channel Gate register</description>
          <addressOffset>0x42140</addressOffset>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>CTIGATEEN3</name>
              <description>Enable ctichout3. Set to 0 to disable channel propagation.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTIGATEEN2</name>
              <description>Enable ctichout2. Set to 0 to disable channel propagation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTIGATEEN1</name>
              <description>Enable ctichout1. Set to 0 to disable channel propagation.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTIGATEEN0</name>
              <description>Enable ctichout0. Set to 0 to disable channel propagation.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASICCTL</name>
          <description>External Multiplexer Control register</description>
          <addressOffset>0x42144</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ASICCTL</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCHOUT</name>
          <description>Integration Test Channel Output register</description>
          <addressOffset>0x42EE4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCHOUT</name>
              <description>Sets the value of the ctichout outputs</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITTRIGOUT</name>
          <description>Integration Test Trigger Output register</description>
          <addressOffset>0x42EE8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTTRIGOUT</name>
              <description>Sets the value of the ctitrigout outputs</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCHIN</name>
          <description>Integration Test Channel Input register</description>
          <addressOffset>0x42EF4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTCHIN</name>
              <description>Reads the value of the ctichin inputs.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>Integration Mode Control register</description>
          <addressOffset>0x42F00</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IME</name>
              <description>Integration Mode Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVARCH</name>
          <description>Device Architecture register</description>
          <addressOffset>0x42FBC</addressOffset>
          <resetValue>0x47701A14</resetValue>
          <fields>
            <field>
              <name>ARCHITECT</name>
              <description>Indicates the component architect</description>
              <bitRange>[31:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRESENT</name>
              <description>Indicates whether the DEVARCH register is present</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Indicates the architecture revision</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARCHID</name>
              <description>Indicates the component</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
