apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>DEVID</name>
          <description>Device Configuration register</description>
          <addressOffset>0x42FC8</addressOffset>
          <resetValue>0x00040800</resetValue>
          <fields>
            <field>
              <name>NUMCH</name>
              <description>Number of ECT channels available</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMTRIG</name>
              <description>Number of ECT triggers available.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTMUXNUM</name>
              <description>Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using asicctl. The default value of 0b00000 indicates that no multiplexing is present. This value of this bit depends on the Verilog define EXTMUXNUM that you must change accordingly.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVTYPE</name>
          <description>Device Type Identifier register</description>
          <addressOffset>0x42FCC</addressOffset>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>SUB</name>
              <description>Sub-classification of the type of the debug component as specified in the ARM Architecture Specification within the major classification as specified in the MAJOR field.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major classification of the type of the debug component as specified in the ARM Architecture Specification for this debug and trace component.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR4</name>
          <description>CoreSight Peripheral ID4</description>
          <addressOffset>0x42FD0</addressOffset>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Always 0b0000. Indicates that the device only occupies 4KB of memory</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_2</name>
              <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR5</name>
          <description>CoreSight Peripheral ID5</description>
          <addressOffset>0x42FD4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR5</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR6</name>
          <description>CoreSight Peripheral ID6</description>
          <addressOffset>0x42FD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR6</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR7</name>
          <description>CoreSight Peripheral ID7</description>
          <addressOffset>0x42FDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PIDR7</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR0</name>
          <description>CoreSight Peripheral ID0</description>
          <addressOffset>0x42FE0</addressOffset>
          <resetValue>0x00000021</resetValue>
          <fields>
            <field>
              <name>PART_0</name>
              <description>Bits[7:0] of the 12-bit part number of the component. The designer of the component assigns this part number.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR1</name>
          <description>CoreSight Peripheral ID1</description>
          <addressOffset>0x42FE4</addressOffset>
          <resetValue>0x000000BD</resetValue>
          <fields>
            <field>
              <name>DES_0</name>
              <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_1</name>
              <description>Bits[11:8] of the 12-bit part number of the component. The designer of the component assigns this part number.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR2</name>
          <description>CoreSight Peripheral ID2</description>
          <addressOffset>0x42FE8</addressOffset>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>This device is at r1p0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEDEC</name>
              <description>Always 1. Indicates that the JEDEC-assigned designer ID is used.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DES_1</name>
              <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIDR3</name>
          <description>CoreSight Peripheral ID3</description>
          <addressOffset>0x42FEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REVAND</name>
              <description>Indicates minor errata fixes specific to the revision of the component being used, for example metal fixes after implementation. In most cases, this field is 0b0000. ARM recommends that the component designers ensure that a metal fix can change this field if required, for example, by driving it from registers that reset to 0b0000.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMOD</name>
              <description>Customer Modified. Indicates whether the customer has modified the behavior of the component. In most cases, this field is 0b0000. Customers change this value when they make authorized modifications to this component.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR0</name>
          <description>CoreSight Component ID0</description>
          <addressOffset>0x42FF0</addressOffset>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PRMBL_0</name>
              <description>Preamble[0]. Contains bits[7:0] of the component identification code</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR1</name>
          <description>CoreSight Component ID1</description>
          <addressOffset>0x42FF4</addressOffset>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>CLASS</name>
              <description>Class of the component, for example, whether the component is a ROM table or a generic CoreSight component. Contains bits[15:12] of the component identification code.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRMBL_1</name>
              <description>Preamble[1]. Contains bits[11:8] of the component identification code.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR2</name>
          <description>CoreSight Component ID2</description>
          <addressOffset>0x42FF8</addressOffset>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PRMBL_2</name>
              <description>Preamble[2]. Contains bits[23:16] of the component identification code.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIDR3</name>
          <description>CoreSight Component ID3</description>
          <addressOffset>0x42FFC</addressOffset>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PRMBL_3</name>
              <description>Preamble[3]. Contains bits[31:24] of the component identification code.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
