apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            If width is single, SD0/MOSI is held asserted low during the dummy phase, and SD1...SD3 are tristated. If width is dual/quad, all IOs are tristated during the dummy phase.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUFFIX_WIDTH</name>
              <description>The width used for the post-address command suffix, if any</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_WIDTH</name>
              <description>The transfer width used for the address. The address phase always transfers 24 bits in total.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREFIX_WIDTH</name>
              <description>The transfer width used for the command prefix, if any</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>M0_WCMD</name>
          <description>Command constants used for writes to memory address window 0.

                    The reset value of the M0_WCMD register is configured to support a basic 02h serial write transfer with no additional configuration.</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x0000A002</resetValue>
          <fields>
            <field>
              <name>SUFFIX</name>
              <description>The command suffix bits following the address, if Mx_WFMT_SUFFIX_LEN is nonzero.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFIX</name>
              <description>The command prefix bits to prepend on each new transfer, if Mx_WFMT_PREFIX_LEN is nonzero.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_TIMING</name>
          <description>Timing configuration register for memory address window 1.</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x40000004</resetValue>
          <fields>
            <field>
              <name>COOLDOWN</name>
              <description>Chip select cooldown period. When a memory transfer finishes, the chip select remains asserted for 64 x COOLDOWN system clock cycles, plus half an SCK clock period (rounded up for odd SCK divisors). After this cooldown expires, the chip select is always deasserted to save power.

                            If the next memory access arrives within the cooldown period, the QMI may be able to append more SCK cycles to the currently ongoing SPI transfer, rather than starting a new transfer. This reduces access latency and increases bus throughput.

                            Specifically, the next access must be in the same direction (read/write), access the same memory window (chip select 0/1), and follow sequentially the address of the last transfer. If any of these are false, the new access will first deassert the chip select, then begin a new transfer.

                            If COOLDOWN is 0, the address alignment configured by PAGEBREAK has been reached, or the total chip select assertion limit MAX_SELECT has been reached, the cooldown period is skipped, and the chip select will always be deasserted one half SCK period after the transfer finishes.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGEBREAK</name>
              <description>When page break is enabled, chip select will automatically deassert when crossing certain power-of-2-aligned address boundaries. The next access will always begin a new read/write SPI burst, even if the address of the next access follows in sequence with the last access before the page boundary.

                            Some flash and PSRAM devices forbid crossing page boundaries with a single read/write transfer, or restrict the operating frequency for transfers that do cross page a boundary. This option allows the QMI to safely support those devices.

                            This field has no effect when COOLDOWN is disabled.</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No page boundary is enforced</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>Break bursts crossing a 256-byte page boundary</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>Break bursts crossing a 1024-byte quad-page boundary</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096</name>
                  <description>Break bursts crossing a 4096-byte sector boundary</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELECT_SETUP</name>
              <description>Add up to one additional system clock cycle of setup between chip select assertion and the first rising edge of SCK.

                            The default setup time is one half SCK period, which is usually sufficient except for very high SCK frequencies with some flash devices.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SELECT_HOLD</name>
              <description>Add up to three additional system clock cycles of active hold between the last falling edge of SCK and the deassertion of this window's chip select.

                            The default hold time is one system clock cycle. Note that flash datasheets usually give chip select active hold time from the last *rising* edge of SCK, and so even zero hold from the last falling edge would be safe.

                            Note that this is a minimum hold time guaranteed by the QMI: the actual chip select active hold may be slightly longer for read transfers with low clock divisors and/or high sample delays. Specifically, if the point two cycles after the last RX data sample is later than the last SCK falling edge, then the hold time is measured from *this* point.

