apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            Note also that, in case the final SCK pulse is masked to save energy (true for non-DTR reads when COOLDOWN is disabled or PAGE_BREAK is reached), all of QMI's timing logic behaves as though the clock pulse were still present. The SELECT_HOLD time is applied from the point where the last SCK falling edge would be if the clock pulse were not masked.</description>
              <bitRange>[24:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_SELECT</name>
              <description>Enforce a maximum assertion duration for this window's chip select, in units of 64 system clock cycles. If 0, the QMI is permitted to keep the chip select asserted indefinitely when servicing sequential memory accesses (see COOLDOWN).

                            This feature is required to meet timing constraints of PSRAM devices, which specify a maximum chip select assertion so they can perform DRAM refresh cycles. See also MIN_DESELECT, which can enforce a minimum deselect time.

                            If a memory access is in progress at the time MAX_SELECT is reached, the QMI will wait for the access to complete before deasserting the chip select. This additional time must be accounted for to calculate a safe MAX_SELECT value. In the worst case, this may be a fully-formed serial transfer, including command prefix and address, with a data payload as large as one cache line.</description>
              <bitRange>[22:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN_DESELECT</name>
              <description>After this window's chip select is deasserted, it remains deasserted for half an SCK cycle (rounded up to an integer number of system clock cycles), plus MIN_DESELECT additional system clock cycles, before the QMI reasserts either chip select pin.

                            Nonzero values may be required for PSRAM devices which enforce a longer minimum CS deselect time, so that they can perform internal DRAM refresh cycles whilst deselected.</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDELAY</name>
              <description>Delay the read data sample timing, in units of one half of a system clock cycle. (Not necessarily half of an SCK cycle.) An RXDELAY of 0 means the sample is captured at the SDI input registers simultaneously with the rising edge of SCK launched from the SCK output register.

                            At higher SCK frequencies, RXDELAY may need to be increased to account for the round trip delay of the pads, and the clock-to-Q delay of the QSPI memory device.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock divisor. Odd and even divisors are supported. Defines the SCK clock period in units of 1 system clock cycle. Divisors 1..255 are encoded directly, and a divisor of 256 is encoded with a value of CLKDIV=0.

                            The clock divisor can be changed on-the-fly, even when the QMI is currently accessing memory in this address window. All other parameters must only be changed when the QMI is idle.

                            If software is increasing CLKDIV in anticipation of an increase in the system clock frequency, a dummy access to either memory window (and appropriate processor barriers/fences) must be inserted after the Mx_TIMING write to ensure the SCK divisor change is in effect _before_ the system clock is changed.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_RFMT</name>
          <description>Read transfer format configuration for memory address window 1.

                    Configure the bus width of each transfer phase individually, and configure the length or presence of the command prefix, command suffix and dummy/turnaround transfer phases. Only 24-bit addresses are supported.

                    The reset value of the M1_RFMT register is configured to support a basic 03h serial read transfer with no additional configuration.</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>DTR</name>
              <description>Enable double transfer rate (DTR) for read commands: address, suffix and read data phases are active on both edges of SCK. SDO data is launched centre-aligned on each SCK edge, and SDI data is captured on the SCK edge that follows its launch.

                            DTR is implemented by halving the clock rate; SCK has a period of 2 x CLK_DIV throughout the transfer. The prefix and dummy phases are still single transfer rate.

                            If the suffix is quad-width, it must be 0 or 8 bits in length, to ensure an even number of SCK edges.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMY_LEN</name>
              <description>Length of dummy phase between command suffix and data phase, in units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4 for single)</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No dummy phase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4 dummy bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 dummy bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>12 dummy bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 dummy bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20</name>
                  <description>20 dummy bits</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>24 dummy bits</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>28 dummy bits</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUFFIX_LEN</name>
              <description>Length of post-address command suffix, in units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4 for single)

                            Only values of 0 and 8 bits are supported.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No suffix</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8-bit suffix</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREFIX_LEN</name>
              <description>Length of command prefix, in units of 8 bits. (i.e. 2 cycles for quad width, 4 for dual, 8 for single)</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No prefix</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8-bit prefix</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_WIDTH</name>
              <description>The width used for the data transfer</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUMMY_WIDTH</name>
              <description>The width used for the dummy phase, if any.

