apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            If width is single, SD0/MOSI is held asserted low during the dummy phase, and SD1...SD3 are tristated. If width is dual/quad, all IOs are tristated during the dummy phase.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUFFIX_WIDTH</name>
              <description>The width used for the post-address command suffix, if any</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_WIDTH</name>
              <description>The transfer width used for the address. The address phase always transfers 24 bits in total.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREFIX_WIDTH</name>
              <description>The transfer width used for the command prefix, if any</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>M1_WCMD</name>
          <description>Command constants used for writes to memory address window 1.

                    The reset value of the M1_WCMD register is configured to support a basic 02h serial write transfer with no additional configuration.</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x0000A002</resetValue>
          <fields>
            <field>
              <name>SUFFIX</name>
              <description>The command suffix bits following the address, if Mx_WFMT_SUFFIX_LEN is nonzero.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PREFIX</name>
              <description>The command prefix bits to prepend on each new transfer, if Mx_WFMT_PREFIX_LEN is nonzero.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATRANS0</name>
          <description>Configure address translation for XIP virtual addresses 0x000000 through 0x3fffff (a 4 MiB window starting at +0 MiB).

                    Address translation allows a program image to be executed in place at multiple physical flash addresses (for example, a double-buffered flash image for over-the-air updates), without the overhead of position-independent code.

                    At reset, the address translation registers are initialised to an identity mapping, so that they can be ignored if address translation is not required.

                    Note that the XIP cache is fully virtually addressed, so a cache flush is required after changing the address translation.</description>
          <addressOffset>0x34</addressOffset>
          <resetValue>0x04000000</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Translation aperture size for this virtual address range, in units of 4 kiB (one flash sector).

                            Bits 21:12 of the virtual address are compared to SIZE. Offsets greater than SIZE return a bus error, and do not cause a QSPI access.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>Physical address base for this virtual address range, in units of 4 kiB (one flash sector).

