apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            Taking a 24-bit virtual address, firstly bits 23:22 (the two MSBs) are masked to zero, and then BASE is added to bits 23:12 (the upper 12 bits) to form the physical address. Translation wraps on a 16 MiB boundary.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATRANS5</name>
          <description>Configure address translation for XIP virtual addresses 0x1400000 through 0x17fffff (a 4 MiB window starting at +20 MiB).

                    Address translation allows a program image to be executed in place at multiple physical flash addresses (for example, a double-buffered flash image for over-the-air updates), without the overhead of position-independent code.

                    At reset, the address translation registers are initialised to an identity mapping, so that they can be ignored if address translation is not required.

                    Note that the XIP cache is fully virtually addressed, so a cache flush is required after changing the address translation.</description>
          <addressOffset>0x48</addressOffset>
          <resetValue>0x04000400</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Translation aperture size for this virtual address range, in units of 4 kiB (one flash sector).

                            Bits 21:12 of the virtual address are compared to SIZE. Offsets greater than SIZE return a bus error, and do not cause a QSPI access.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>Physical address base for this virtual address range, in units of 4 kiB (one flash sector).

                            Taking a 24-bit virtual address, firstly bits 23:22 (the two MSBs) are masked to zero, and then BASE is added to bits 23:12 (the upper 12 bits) to form the physical address. Translation wraps on a 16 MiB boundary.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATRANS6</name>
          <description>Configure address translation for XIP virtual addresses 0x1800000 through 0x1bfffff (a 4 MiB window starting at +24 MiB).

                    Address translation allows a program image to be executed in place at multiple physical flash addresses (for example, a double-buffered flash image for over-the-air updates), without the overhead of position-independent code.

                    At reset, the address translation registers are initialised to an identity mapping, so that they can be ignored if address translation is not required.

                    Note that the XIP cache is fully virtually addressed, so a cache flush is required after changing the address translation.</description>
          <addressOffset>0x4C</addressOffset>
          <resetValue>0x04000800</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Translation aperture size for this virtual address range, in units of 4 kiB (one flash sector).

                            Bits 21:12 of the virtual address are compared to SIZE. Offsets greater than SIZE return a bus error, and do not cause a QSPI access.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>Physical address base for this virtual address range, in units of 4 kiB (one flash sector).

                            Taking a 24-bit virtual address, firstly bits 23:22 (the two MSBs) are masked to zero, and then BASE is added to bits 23:12 (the upper 12 bits) to form the physical address. Translation wraps on a 16 MiB boundary.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATRANS7</name>
          <description>Configure address translation for XIP virtual addresses 0x1c00000 through 0x1ffffff (a 4 MiB window starting at +28 MiB).

                    Address translation allows a program image to be executed in place at multiple physical flash addresses (for example, a double-buffered flash image for over-the-air updates), without the overhead of position-independent code.

                    At reset, the address translation registers are initialised to an identity mapping, so that they can be ignored if address translation is not required.

                    Note that the XIP cache is fully virtually addressed, so a cache flush is required after changing the address translation.</description>
          <addressOffset>0x50</addressOffset>
          <resetValue>0x04000C00</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>Translation aperture size for this virtual address range, in units of 4 kiB (one flash sector).

                            Bits 21:12 of the virtual address are compared to SIZE. Offsets greater than SIZE return a bus error, and do not cause a QSPI access.</description>
              <bitRange>[26:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>Physical address base for this virtual address range, in units of 4 kiB (one flash sector).

                            Taking a 24-bit virtual address, firstly bits 23:22 (the two MSBs) are masked to zero, and then BASE is added to bits 23:12 (the upper 12 bits) to form the physical address. Translation wraps on a 16 MiB boundary.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
