apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            Accesses to the uncached (addr[26] == 1) window will never query the cache, irrespective of this bit.

                            There is no cache-as-SRAM address window. Cache lines are allocated for SRAM-like use by individually pinning them, and keeping the cache enabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>FIFO_FULL</name>
              <description>When 1, indicates the XIP streaming FIFO is completely full. 
                            The streaming FIFO is 2 entries deep, so the full and empty 
                            flag allow its level to be ascertained.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>When 1, indicates the XIP streaming FIFO is completely empty.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR_HIT</name>
          <description>Cache Hit counter</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTR_HIT</name>
              <description>A 32 bit saturating counter that increments upon each cache hit, 
                            i.e. when an XIP access is serviced directly from cached data. 
                            Write any value to clear.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR_ACC</name>
          <description>Cache Access counter</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTR_ACC</name>
              <description>A 32 bit saturating counter that increments upon each XIP access, 
                            whether the cache is hit or not. This includes noncacheable accesses. 
                            Write any value to clear.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_ADDR</name>
          <description>FIFO stream address</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STREAM_ADDR</name>
              <description>The address of the next word to be streamed from flash to the streaming FIFO. 
                            Increments automatically after each flash access. 
                            Write the initial access address here before starting a streaming read.</description>
              <bitRange>[31:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_CTR</name>
          <description>FIFO stream control</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STREAM_CTR</name>
              <description>Write a nonzero value to start a streaming read. This will then 
                            progress in the background, using flash idle cycles to transfer 
                            a linear data block from flash to the streaming FIFO. 
                            Decrements automatically (1 at a time) as the stream 
                            progresses, and halts on reaching 0. 
                            Write 0 to halt an in-progress stream, and discard any in-flight 
                            read, so that a new stream can immediately be started (after 
                            draining the FIFO and reinitialising STREAM_ADDR)</description>
              <bitRange>[21:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_FIFO</name>
          <description>FIFO stream data</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STREAM_FIFO</name>
              <description>Streamed data is buffered here, for retrieval by the system DMA. 
                            This FIFO can also be accessed via the XIP_AUX slave, to avoid exposing 
                            the DMA to bus stalls caused by other XIP traffic.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>XIP_AUX</name>
      <description>Auxiliary DMA access to XIP FIFOs, via fast AHB bus access</description>
      <baseAddress>0x50500000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STREAM</name>
          <description>Read the XIP stream FIFO (fast bus access to XIP_CTRL_STREAM_FIFO)</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STREAM</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>QMI_DIRECT_TX</name>
          <description>Write to the QMI direct-mode TX FIFO (fast bus access to QMI_DIRECT_TX)</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NOPUSH</name>
              <description>Inhibit the RX FIFO push that would correspond to this TX FIFO entry.

                            Useful to avoid garbage appearing in the RX FIFO when pushing the command at the beginning of a SPI transfer.</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>OE</name>
              <description>Output enable (active-high). For single width (SPI), this field is ignored, and SD0 is always set to output, with SD1 always set to input.

