apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            For dual and quad width (DSPI/QSPI), this sets whether the relevant SDx pads are set to output whilst transferring this FIFO record. In this case the command/address should have OE set, and the data transfer should have OE set or clear depending on the direction of the transfer.</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DWIDTH</name>
              <description>Data width. If 0, hardware will transmit the 8 LSBs of the DIRECT_TX DATA field, and return an 8-bit value in the 8 LSBs of DIRECT_RX. If 1, the full 16-bit width is used. 8-bit and 16-bit transfers can be mixed freely.</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>IWIDTH</name>
              <description>Configure whether this FIFO record is transferred with single/dual/quad interface width (0/1/2). Different widths can be mixed freely.</description>
              <bitRange>[17:16]</bitRange>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S</name>
                  <description>Single width</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Dual width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Q</name>
                  <description>Quad width</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA</name>
              <description>Data pushed here will be clocked out falling edges of SCK (or before the very first rising edge of SCK, if this is the first pulse). For each byte clocked out, the interface will simultaneously sample one byte, on rising edges of SCK, and push this to the DIRECT_RX FIFO.

                            For 16-bit data, the least-significant byte is transmitted first.</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QMI_DIRECT_RX</name>
          <description>Read from the QMI direct-mode RX FIFO (fast bus access to QMI_DIRECT_RX)</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>QMI_DIRECT_RX</name>
              <description>With each byte clocked out on the serial interface, one byte will simultaneously be clocked in, and will appear in this FIFO. The serial interface will stall when this FIFO is full, to avoid dropping data.

                            When 16-bit data is pushed into the TX FIFO, the corresponding RX FIFO push will also contain 16 bits of data. The least-significant byte is the first one received.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>Register block for various chip control signals</description>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PROC_CONFIG</name>
          <description>Configuration for processors</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROC1_HALTED</name>
              <description>Indication that proc1 has halted</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC0_HALTED</name>
              <description>Indication that proc0 has halted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROC_IN_SYNC_BYPASS</name>
          <description>For each bit, if 1, bypass the input synchronizer between that GPIO 
                    and the GPIO input register in the SIO. The input synchronizers should 
                    generally be unbypassed, to avoid injecting metastabilities into processors. 
                    If you're feeling brave, you can bypass to save two cycles of input 
                    latency. This register applies to GPIO 0...31.</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPIO</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROC_IN_SYNC_BYPASS_HI</name>
          <description>For each bit, if 1, bypass the input synchronizer between that GPIO 
                    and the GPIO input register in the SIO. The input synchronizers should 
                    generally be unbypassed, to avoid injecting metastabilities into processors. 
                    If you're feeling brave, you can bypass to save two cycles of input 
                    latency. This register applies to GPIO 32...47. USB GPIO 56..57 QSPI GPIO 58..63</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>QSPI_SD</name>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QSPI_CSN</name>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QSPI_SCK</name>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DM</name>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DP</name>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGFORCE</name>
          <description>Directly control the chip SWD debug port</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>ATTACH</name>
              <description>Attach chip debug port to syscfg controls, and disconnect it from external SWD pads.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWCLK</name>
              <description>Directly drive SWCLK, if ATTACH is set</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWDI</name>
              <description>Directly drive SWDIO input, if ATTACH is set</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWDO</name>
              <description>Observe the value of SWDIO output.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPOWERDOWN</name>
          <description>Control PD pins to memories. 
                    Set high to put memories to a low power state. In this state the memories will retain contents but not be accessible 
                    Use with caution</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTRAM</name>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM</name>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB</name>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM9</name>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM8</name>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCTRL</name>
          <description>Auxiliary system control register</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXCTRL</name>
              <description>* Bits 7:2: Reserved

                            * Bit 1: When clear, the LPOSC output is XORed into the TRNG ROSC output as an additional, uncorrelated entropy source. When set, this behaviour is disabled.

                            * Bit 0: Force POWMAN clock to switch to LPOSC, by asserting its WDRESET input. This must be set before initiating a watchdog reset of the RSM from a stage that includes CLOCKS, if POWMAN is running from clk_ref at the point that the watchdog reset takes place. Otherwise, the short pulse generated on clk_ref by the reset of the CLOCKS block may affect POWMAN register state.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
