apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>POW_DELAY</name>
          <description>power state machine delays</description>
          <addressOffset>0x40</addressOffset>
          <resetValue>0x00002011</resetValue>
          <fields>
            <field>
              <name>SRAM_STEP</name>
              <description>timing between the sram0 and sram1 power state machine steps 
                            measured in units of the powman tick period (&gt;=1us), 0 gives a delay of 1 unit</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XIP_STEP</name>
              <description>timing between the xip power state machine steps 
                            measured in units of the lposc period, 0 gives a delay of 1 unit</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SWCORE_STEP</name>
              <description>timing between the swcore power state machine steps 
                            measured in units of the lposc period, 0 gives a delay of 1 unit</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_CTRL0</name>
          <description>Configures a gpio as a power mode aware control output</description>
          <addressOffset>0x44</addressOffset>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>LP_EXIT_STATE</name>
              <description>output level when exiting the low power state</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ENTRY_STATE</name>
              <description>output level when entering the low power state</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_STATE</name>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT</name>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SELECT</name>
              <description>selects from gpio 0-&gt;30 
                            set to 31 to disable this feature</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_CTRL1</name>
          <description>Configures a gpio as a power mode aware control output</description>
          <addressOffset>0x48</addressOffset>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>LP_EXIT_STATE</name>
              <description>output level when exiting the low power state</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_ENTRY_STATE</name>
              <description>output level when entering the low power state</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_STATE</name>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT</name>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_SELECT</name>
              <description>selects from gpio 0-&gt;30 
                            set to 31 to disable this feature</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_TIME_REF</name>
          <description>Select a GPIO to use as a time reference, the source can be used to drive the low power clock at 32kHz, or to provide a 1ms tick to the timer, or provide a 1Hz tick to the timer. The tick selection is controlled by the POWMAN_TIMER register.</description>
          <addressOffset>0x4C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DRIVE_LPCK</name>
              <description>Use the selected GPIO to drive the 32kHz low power clock, in place of LPOSC. This field must only be written when POWMAN_TIMER_RUN=0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE_SEL</name>
              <description>0 -&gt;  gpio12 
                            1 -&gt;  gpio20 
                            2 -&gt;  gpio14 
                            3 -&gt;  gpio22</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOSC_FREQ_KHZ_INT</name>
          <description>Informs the AON Timer of the integer component of the clock frequency when running off the LPOSC.</description>
          <addressOffset>0x50</addressOffset>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>LPOSC_FREQ_KHZ_INT</name>
              <description>Integer component of the LPOSC or GPIO clock source frequency in kHz. Default = 32 This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOSC_FREQ_KHZ_FRAC</name>
          <description>Informs the AON Timer of the fractional component of the clock frequency when running off the LPOSC.</description>
          <addressOffset>0x54</addressOffset>
          <resetValue>0x0000C49C</resetValue>
          <fields>
            <field>
              <name>LPOSC_FREQ_KHZ_FRAC</name>
              <description>Fractional component of the LPOSC or GPIO clock source frequency in kHz. Default = 0.768 This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC_FREQ_KHZ_INT</name>
          <description>Informs the AON Timer of the integer component of the clock frequency when running off the XOSC.</description>
          <addressOffset>0x58</addressOffset>
          <resetValue>0x00002EE0</resetValue>
          <fields>
            <field>
              <name>XOSC_FREQ_KHZ_INT</name>
              <description>Integer component of the XOSC frequency in kHz. Default = 12000 Must be &gt;1 This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC_FREQ_KHZ_FRAC</name>
          <description>Informs the AON Timer of the fractional component of the clock frequency when running off the XOSC.</description>
          <addressOffset>0x5C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XOSC_FREQ_KHZ_FRAC</name>
              <description>Fractional component of the XOSC frequency in kHz. This field must only be written when POWMAN_TIMER_RUN=0 or POWMAN_TIMER_USING_XOSC=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_TIME_63TO48</name>
          <addressOffset>0x60</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SET_TIME_63TO48</name>
              <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_TIME_47TO32</name>
          <addressOffset>0x64</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SET_TIME_47TO32</name>
              <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_TIME_31TO16</name>
          <addressOffset>0x68</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SET_TIME_31TO16</name>
              <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_TIME_15TO0</name>
          <addressOffset>0x6C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SET_TIME_15TO0</name>
              <description>For setting the time, do not use for reading the time, use POWMAN_READ_TIME_UPPER and POWMAN_READ_TIME_LOWER. This field must only be written when POWMAN_TIMER_RUN=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_TIME_UPPER</name>
          <addressOffset>0x70</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_TIME_UPPER</name>
              <description>For reading bits 63:32 of the timer. When reading all 64 bits it is possible for the LOWER count to rollover during the read. It is recommended to read UPPER, then LOWER, then re-read UPPER and, if it has changed, re-read LOWER.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_TIME_LOWER</name>
          <addressOffset>0x74</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_TIME_LOWER</name>
              <description>For reading bits 31:0 of the timer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_TIME_63TO48</name>
          <addressOffset>0x78</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_TIME_63TO48</name>
              <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_TIME_47TO32</name>
          <addressOffset>0x7C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_TIME_47TO32</name>
              <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_TIME_31TO16</name>
          <addressOffset>0x80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_TIME_31TO16</name>
              <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARM_TIME_15TO0</name>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALARM_TIME_15TO0</name>
              <description>This field must only be written when POWMAN_ALARM_ENAB=0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER</name>
          <addressOffset>0x88</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USING_GPIO_1HZ</name>
              <description>Timer is synchronised to a 1hz gpio source</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USING_GPIO_1KHZ</name>
              <description>Timer is running from a 1khz gpio source</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USING_LPOSC</name>
              <description>Timer is running from lposc</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USING_XOSC</name>
              <description>Timer is running from xosc</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USE_GPIO_1HZ</name>
              <description>Selects the gpio source as the reference for the sec counter. The msec counter will continue to use the lposc or xosc reference.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_GPIO_1KHZ</name>
              <description>switch to gpio as the source of the 1kHz timer tick</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USE_XOSC</name>
              <description>switch to xosc as the source of the 1kHz timer tick</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USE_LPOSC</name>
              <description>Switch to lposc as the source of the 1kHz timer tick</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ALARM</name>
              <description>Alarm has fired. Write to 1 to clear the alarm.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PWRUP_ON_ALARM</name>
              <description>Alarm wakes the chip from low power mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ALARM_ENAB</name>
              <description>Enables the alarm. The alarm must be disabled while writing the alarm time.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLEAR</name>
              <description>Clears the timer, does not disable the timer and does not affect the alarm. This control can be written at any time.</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RUN</name>
              <description>Timer enable. Setting this bit causes the timer to begin counting up from its current value. Clearing this bit stops the timer from counting.

                            Before enabling the timer, set the POWMAN_LPOSC_FREQ* and POWMAN_XOSC_FREQ* registers to configure the count rate, and initialise the current time by writing to SET_TIME_63TO48 through SET_TIME_15TO0. You must not write to the SET_TIME_x registers when the timer is running.

                            Once configured, start the timer by setting POWMAN_TIMER_RUN=1. This will start the timer running from the LPOSC. When the XOSC is available switch the reference clock to XOSC then select it as the timer clock by setting POWMAN_TIMER_USE_XOSC=1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NONSEC_WRITE</name>
              <description>Control whether Non-secure software can write to the timer registers. All other registers are hardwired to be inaccessible to Non-secure.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRUP0</name>
          <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
          <addressOffset>0x8C</addressOffset>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>RAW_STATUS</name>
              <description>Value of selected gpio pin (only if enable == 1)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS</name>
              <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>level</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edge</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECTION</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_falling</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_rising</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
