apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>PWRUP1</name>
          <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
          <addressOffset>0x90</addressOffset>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>RAW_STATUS</name>
              <description>Value of selected gpio pin (only if enable == 1)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS</name>
              <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>level</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edge</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECTION</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_falling</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_rising</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRUP2</name>
          <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
          <addressOffset>0x94</addressOffset>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>RAW_STATUS</name>
              <description>Value of selected gpio pin (only if enable == 1)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS</name>
              <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>level</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edge</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECTION</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_falling</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_rising</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRUP3</name>
          <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
          <addressOffset>0x98</addressOffset>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>RAW_STATUS</name>
              <description>Value of selected gpio pin (only if enable == 1)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATUS</name>
              <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>level</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>edge</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECTION</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_falling</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_rising</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CURRENT_PWRUP_REQ</name>
          <description>Indicates current powerup request state 
                    pwrup events can be cleared by removing the enable from the pwrup register. The alarm pwrup req can be cleared by clearing timer.alarm_enab 
                    0 = chip reset, for the source of the last reset see POWMAN_CHIP_RESET 
                    1 = pwrup0 
                    2 = pwrup1 
                    3 = pwrup2 
                    4 = pwrup3 
                    5 = coresight_pwrup 
                    6 = alarm_pwrup</description>
          <addressOffset>0x9C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRENT_PWRUP_REQ</name>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LAST_SWCORE_PWRUP</name>
          <description>Indicates which pwrup source triggered the last switched-core power up 
                    0 = chip reset, for the source of the last reset see POWMAN_CHIP_RESET 
                    1 = pwrup0 
                    2 = pwrup1 
                    3 = pwrup2 
                    4 = pwrup3 
                    5 = coresight_pwrup 
                    6 = alarm_pwrup</description>
          <addressOffset>0xA0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LAST_SWCORE_PWRUP</name>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_PWRCFG</name>
          <addressOffset>0xA4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IGNORE</name>
              <description>Ignore pwrup req from debugger. If pwrup req is asserted then this will prevent power down and set powerdown blocked. Set ignore to stop paying attention to pwrup_req</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTDIS</name>
          <description>Tell the bootrom to ignore the BOOT0..3 registers following the next RSM reset (e.g. the next core power down/up).

                    If an early boot stage has soft-locked some OTP pages in order to protect their contents from later stages, there is a risk that Secure code running at a later stage can unlock the pages by powering the core up and down.

                    This register can be used to ensure that the bootloader runs as normal on the next power up, preventing Secure code at a later stage from accessing OTP in its unlocked state.

