apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    Should be used in conjunction with the OTP BOOTDIS register.</description>
          <addressOffset>0xA8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NEXT</name>
              <description>This flag always ORs writes into its current contents. It can be set but not cleared by software.

                            The BOOTDIS_NEXT bit is OR'd into the BOOTDIS_NOW bit when the core is powered down. Simultaneously, the BOOTDIS_NEXT bit is cleared. Setting this bit means that the BOOT0..3 registers will be ignored following the next reset of the RSM by powman.

                            This flag should be set by an early boot stage that has soft-locked OTP pages, to prevent later stages from unlocking it by power cycling.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NOW</name>
              <description>When powman resets the RSM, the current value of BOOTDIS_NEXT is OR'd into BOOTDIS_NOW, and BOOTDIS_NEXT is cleared.

                            The bootrom checks this flag before reading the BOOT0..3 registers. If it is set, the bootrom clears it, and ignores the BOOT registers. This prevents Secure software from diverting the boot path before a bootloader has had the chance to soft lock OTP pages containing sensitive data.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCONFIG</name>
          <addressOffset>0xAC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DP_INSTID</name>
              <description>Configure DP instance ID for SWD multidrop selection. 
                            Recommend that this is NOT changed until you require debug access in multi-chip environment</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH0</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xB0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH1</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xB4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH2</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xB8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH3</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xBC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH3</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH4</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xC0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH4</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH5</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xC4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH5</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH6</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xC8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH6</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH7</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xCC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SCRATCH7</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT0</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xD0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT1</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xD4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT2</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT3</name>
          <description>Scratch register. Information persists in low power mode</description>
          <addressOffset>0xDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT3</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Raw Interrupts</description>
          <addressOffset>0xE0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRUP_WHILE_WAITING</name>
              <description>Source is state.pwrup_while_waiting</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE_REQ_IGNORED</name>
              <description>Source is state.req_ignored</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VREG_OUTPUT_LOW</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0xE4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRUP_WHILE_WAITING</name>
              <description>Source is state.pwrup_while_waiting</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE_REQ_IGNORED</name>
              <description>Source is state.req_ignored</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREG_OUTPUT_LOW</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <description>Interrupt Force</description>
          <addressOffset>0xE8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRUP_WHILE_WAITING</name>
              <description>Source is state.pwrup_while_waiting</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STATE_REQ_IGNORED</name>
              <description>Source is state.req_ignored</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VREG_OUTPUT_LOW</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS</name>
          <description>Interrupt status after masking &amp; forcing</description>
          <addressOffset>0xEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PWRUP_WHILE_WAITING</name>
              <description>Source is state.pwrup_while_waiting</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE_REQ_IGNORED</name>
              <description>Source is state.req_ignored</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VREG_OUTPUT_LOW</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
