apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA with separate read and write masters</description>
      <baseAddress>0x50000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xBC8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_IRQ_0</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA_IRQ_1</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA_IRQ_2</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA_IRQ_3</name>
        <value>13</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing CH?_READ_ADDR,CH??_READ_ADDR, CH?_WRITE_ADDR,CH??_WRITE_ADDR, CH?_TRANS_COUNT,CH??_TRANS_COUNT, CH?_CTRL_TRIG,CH??_CTRL_TRIG, CH?_AL1_CTRL,CH??_AL1_CTRL, CH?_AL1_READ_ADDR,CH??_AL1_READ_ADDR, CH?_AL1_WRITE_ADDR,CH??_AL1_WRITE_ADDR, CH?_AL1_TRANS_COUNT_TRIG,CH??_AL1_TRANS_COUNT_TRIG, CH?_AL2_CTRL,CH??_AL2_CTRL, CH?_AL2_TRANS_COUNT,CH??_AL2_TRANS_COUNT, CH?_AL2_READ_ADDR,CH??_AL2_READ_ADDR, CH?_AL2_WRITE_ADDR_TRIG,CH??_AL2_WRITE_ADDR_TRIG, CH?_AL3_CTRL,CH??_AL3_CTRL, CH?_AL3_WRITE_ADDR,CH??_AL3_WRITE_ADDR, CH?_AL3_TRANS_COUNT,CH??_AL3_TRANS_COUNT, CH?_AL3_READ_ADDR_TRIG,CH??_AL3_READ_ADDR_TRIG</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CH_READ_ADDR</name>
            <description>DMA Channel 0 Read Address pointer</description>
            <addressOffset>0x0</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CH0_READ_ADDR</name>
                <description>This register updates automatically each time a read completes. The current value is the next address to be read by this channel.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_WRITE_ADDR</name>
            <description>DMA Channel 0 Write Address pointer</description>
            <addressOffset>0x4</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CH0_WRITE_ADDR</name>
                <description>This register updates automatically each time a write completes. The current value is the next address to be written by this channel.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_TRANS_COUNT</name>
            <description>DMA Channel 0 Transfer Count</description>
            <addressOffset>0x8</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MODE</name>
                <description>When MODE is 0x0, the transfer count decrements with each transfer until 0, and then the channel triggers the next channel indicated by CTRL_CHAIN_TO.

                            When MODE is 0x1, the transfer count decrements with each transfer until 0, and then the channel re-triggers itself, in addition to the trigger indicated by CTRL_CHAIN_TO. This is useful for e.g. an endless ring-buffer DMA with periodic interrupts.

                            When MODE is 0xf, the transfer count does not decrement. The DMA channel performs an endless sequence of transfers, never triggering other channels or raising interrupts, until an ABORT is raised.

                            All other values are reserved.</description>
                <bitRange>[31:28]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TRIGGER_SELF</name>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENDLESS</name>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COUNT</name>
                <description>28-bit transfer count (256 million transfers maximum).

                            Program the number of bus transfers a channel will perform before halting. Note that, if transfers are larger than one byte in size, this is not equal to the number of bytes transferred (see CTRL_DATA_SIZE).

                            When the channel is active, reading this register shows the number of transfers remaining, updating automatically each time a write transfer completes.

                            Writing this register sets the RELOAD value for the transfer counter. Each time this channel is triggered, the RELOAD value is copied into the live transfer counter. The channel can be started multiple times, and will perform the same number of transfers each time, as programmed by most recent write.

                            The RELOAD value can be observed at CHx_DBG_TCR. If TRANS_COUNT is used as a trigger, the written value is used immediately as the length of the new transfer sequence, as well as being written to RELOAD.</description>
                <bitRange>[27:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_CTRL_TRIG</name>
            <description>DMA Channel 0 Control and Status</description>
            <addressOffset>0xC</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AHB_ERROR</name>
                <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>READ_ERROR</name>
                <description>If 1, the channel received a read bus error. Write one to clear. 
                            READ_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 3 transfers later)</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>WRITE_ERROR</name>
                <description>If 1, the channel received a write bus error. Write one to clear. 
                            WRITE_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 5 transfers later)</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>BUSY</name>
                <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.

                            To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
                <bitRange>[26:26]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SNIFF_EN</name>
                <description>If 1, this channel's data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.

