apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>DMA Channel Enable. 
                            When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL1_CTRL</name>
            <description>DMA Channel 0 Control and Status</description>
            <addressOffset>0x10</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AHB_ERROR</name>
                <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>READ_ERROR</name>
                <description>If 1, the channel received a read bus error. Write one to clear. 
                            READ_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 3 transfers later)</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>WRITE_ERROR</name>
                <description>If 1, the channel received a write bus error. Write one to clear. 
                            WRITE_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 5 transfers later)</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>BUSY</name>
                <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.

                            To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
                <bitRange>[26:26]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SNIFF_EN</name>
                <description>If 1, this channel's data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.

                            This allows checksum to be enabled or disabled on a per-control- block basis.</description>
                <bitRange>[25:25]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BSWAP</name>
                <description>Apply byte-swap transformation to DMA data. 
                            For byte data, this has no effect. For halfword data, the two bytes of each halfword are swapped. For word data, the four bytes of each word are swapped to reverse order.</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IRQ_QUIET</name>
                <description>In QUIET mode, the channel does not generate IRQs at the end of every transfer block. Instead, an IRQ is raised when NULL is written to a trigger register, indicating the end of a control block chain.

                            This reduces the number of interrupts to be serviced by the CPU when transferring a DMA chain of many small control blocks.</description>
                <bitRange>[23:23]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TREQ_SEL</name>
                <description>Select a Transfer Request signal. 
                            The channel uses the transfer request signal to pace its data transfer rate. Sources for TREQ signals are internal (TIMERS) or external (DREQ, a Data Request from the system). 
                            0x0 to 0x3a -&gt; select DREQ n as TREQ</description>
                <bitRange>[22:17]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <name>TREQ_SEL</name>
                  <enumeratedValue>
                    <name>PIO0_TX0</name>
                    <description>Select PIO0's TX FIFO 0 as TREQ</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO0_TX1</name>
                    <description>Select PIO0's TX FIFO 1 as TREQ</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO0_TX2</name>
                    <description>Select PIO0's TX FIFO 2 as TREQ</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO0_TX3</name>
                    <description>Select PIO0's TX FIFO 3 as TREQ</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO0_RX0</name>
                    <description>Select PIO0's RX FIFO 0 as TREQ</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO0_RX1</name>
                    <description>Select PIO0's RX FIFO 1 as TREQ</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO0_RX2</name>
                    <description>Select PIO0's RX FIFO 2 as TREQ</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO0_RX3</name>
                    <description>Select PIO0's RX FIFO 3 as TREQ</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_TX0</name>
                    <description>Select PIO1's TX FIFO 0 as TREQ</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_TX1</name>
                    <description>Select PIO1's TX FIFO 1 as TREQ</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_TX2</name>
                    <description>Select PIO1's TX FIFO 2 as TREQ</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_TX3</name>
                    <description>Select PIO1's TX FIFO 3 as TREQ</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_RX0</name>
                    <description>Select PIO1's RX FIFO 0 as TREQ</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_RX1</name>
                    <description>Select PIO1's RX FIFO 1 as TREQ</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_RX2</name>
                    <description>Select PIO1's RX FIFO 2 as TREQ</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO1_RX3</name>
                    <description>Select PIO1's RX FIFO 3 as TREQ</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_TX0</name>
                    <description>Select PIO2's TX FIFO 0 as TREQ</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_TX1</name>
                    <description>Select PIO2's TX FIFO 1 as TREQ</description>
                    <value>17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_TX2</name>
                    <description>Select PIO2's TX FIFO 2 as TREQ</description>
                    <value>18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_TX3</name>
                    <description>Select PIO2's TX FIFO 3 as TREQ</description>
                    <value>19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_RX0</name>
                    <description>Select PIO2's RX FIFO 0 as TREQ</description>
                    <value>20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_RX1</name>
                    <description>Select PIO2's RX FIFO 1 as TREQ</description>
                    <value>21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_RX2</name>
                    <description>Select PIO2's RX FIFO 2 as TREQ</description>
                    <value>22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIO2_RX3</name>
                    <description>Select PIO2's RX FIFO 3 as TREQ</description>
                    <value>23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI0_TX</name>
                    <description>Select SPI0's TX FIFO as TREQ</description>
                    <value>24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI0_RX</name>
                    <description>Select SPI0's RX FIFO as TREQ</description>
                    <value>25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI1_TX</name>
                    <description>Select SPI1's TX FIFO as TREQ</description>
                    <value>26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPI1_RX</name>
                    <description>Select SPI1's RX FIFO as TREQ</description>
                    <value>27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART0_TX</name>
                    <description>Select UART0's TX FIFO as TREQ</description>
                    <value>28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART0_RX</name>
                    <description>Select UART0's RX FIFO as TREQ</description>
                    <value>29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART1_TX</name>
                    <description>Select UART1's TX FIFO as TREQ</description>
                    <value>30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UART1_RX</name>
                    <description>Select UART1's RX FIFO as TREQ</description>
                    <value>31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP0</name>
                    <description>Select PWM Counter 0's Wrap Value as TREQ</description>
                    <value>32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP1</name>
                    <description>Select PWM Counter 1's Wrap Value as TREQ</description>
                    <value>33</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP2</name>
                    <description>Select PWM Counter 2's Wrap Value as TREQ</description>
                    <value>34</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP3</name>
                    <description>Select PWM Counter 3's Wrap Value as TREQ</description>
                    <value>35</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP4</name>
                    <description>Select PWM Counter 4's Wrap Value as TREQ</description>
                    <value>36</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP5</name>
                    <description>Select PWM Counter 5's Wrap Value as TREQ</description>
                    <value>37</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP6</name>
                    <description>Select PWM Counter 6's Wrap Value as TREQ</description>
                    <value>38</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP7</name>
                    <description>Select PWM Counter 7's Wrap Value as TREQ</description>
                    <value>39</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP8</name>
                    <description>Select PWM Counter 8's Wrap Value as TREQ</description>
                    <value>40</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP9</name>
                    <description>Select PWM Counter 9's Wrap Value as TREQ</description>
                    <value>41</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP10</name>
                    <description>Select PWM Counter 10's Wrap Value as TREQ</description>
                    <value>42</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM_WRAP11</name>
                    <description>Select PWM Counter 11's Wrap Value as TREQ</description>
                    <value>43</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C0_TX</name>
                    <description>Select I2C0's TX FIFO as TREQ</description>
                    <value>44</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C0_RX</name>
                    <description>Select I2C0's RX FIFO as TREQ</description>
                    <value>45</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C1_TX</name>
                    <description>Select I2C1's TX FIFO as TREQ</description>
                    <value>46</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I2C1_RX</name>
                    <description>Select I2C1's RX FIFO as TREQ</description>
                    <value>47</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADC</name>
                    <description>Select ADC as TREQ</description>
                    <value>48</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XIP_STREAM</name>
                    <description>Select XIP_STREAM as TREQ</description>
                    <value>49</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XIP_QMITX</name>
                    <description>Select XIP_QMI's TX FIFO as TREQ</description>
                    <value>50</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>XIP_QMIRX</name>
                    <description>Select XIP_QMI's RX FIFO as TREQ</description>
                    <value>51</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HSTX</name>
                    <description>Select HSTX as TREQ</description>
                    <value>52</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CORESIGHT</name>
                    <description>Select CORESIGHT as TREQ</description>
                    <value>53</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHA256</name>
                    <description>Select SHA256 as TREQ</description>
                    <value>54</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER0</name>
                    <description>Select Timer 0 as TREQ</description>
                    <value>59</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER1</name>
                    <description>Select Timer 1 as TREQ</description>
                    <value>60</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER2</name>
                    <description>Select Timer 2 as TREQ (Optional)</description>
                    <value>61</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMER3</name>
                    <description>Select Timer 3 as TREQ (Optional)</description>
                    <value>62</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PERMANENT</name>
                    <description>Permanent request, for unpaced transfers.</description>
                    <value>63</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CHAIN_TO</name>
                <description>When this channel completes, it will trigger the channel indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_. \n Reset value is 0, which means for channels 1 and above the default will be to chain to channel 0 - set this field to avoid this behaviour.</description>
                <bitRange>[16:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RING_SEL</name>
                <description>Select whether RING_SIZE applies to read or write addresses. 
                            If 0, read addresses are wrapped on a (1 &lt;&lt; RING_SIZE) boundary. If 1, write addresses are wrapped.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RING_SIZE</name>
                <description>Size of address wrap region. If 0, don't wrap. For values n &gt; 0, only the lower n bits of the address will change. This wraps the address on a (1 &lt;&lt; n) byte boundary, facilitating access to naturally-aligned ring buffers.

                            Ring sizes between 2 and 32768 bytes are possible. This can apply to either read or write addresses, based on value of RING_SEL.</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RING_NONE</name>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INCR_WRITE_REV</name>
                <description>If 1, and INCR_WRITE is 1, the write address is decremented rather than incremented with each transfer.

                            If 1, and INCR_WRITE is 0, this otherwise-unused combination causes the write address to be incremented by twice the transfer size, i.e. skipping over alternate addresses.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INCR_WRITE</name>
                <description>If 1, the write address increments with each transfer. If 0, each write is directed to the same, initial address.

                            Generally this should be disabled for memory-to-peripheral transfers.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INCR_READ_REV</name>
                <description>If 1, and INCR_READ is 1, the read address is decremented rather than incremented with each transfer.

                            If 1, and INCR_READ is 0, this otherwise-unused combination causes the read address to be incremented by twice the transfer size, i.e. skipping over alternate addresses.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INCR_READ</name>
                <description>If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.

