apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            Generally this should be disabled for peripheral-to-memory transfers.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_SIZE</name>
                <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SIZE_BYTE</name>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_HALFWORD</name>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_WORD</name>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HIGH_PRIORITY</name>
                <description>HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.

                            This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>DMA Channel Enable. 
                            When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL1_READ_ADDR</name>
            <description>Alias for channel 0 READ_ADDR register</description>
            <addressOffset>0x14</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CH0_AL1_READ_ADDR</name>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL1_WRITE_ADDR</name>
            <description>Alias for channel 0 WRITE_ADDR register</description>
            <addressOffset>0x18</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CH0_AL1_WRITE_ADDR</name>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL1_TRANS_COUNT_TRIG</name>
            <description>Alias for channel 0 TRANS_COUNT register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
            <addressOffset>0x1C</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CH0_AL1_TRANS_COUNT_TRIG</name>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL2_CTRL</name>
            <description>DMA Channel 0 Control and Status</description>
            <addressOffset>0x20</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>AHB_ERROR</name>
                <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>READ_ERROR</name>
                <description>If 1, the channel received a read bus error. Write one to clear. 
                            READ_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 3 transfers later)</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>WRITE_ERROR</name>
                <description>If 1, the channel received a write bus error. Write one to clear. 
                            WRITE_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 5 transfers later)</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>BUSY</name>
                <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.

                            To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
                <bitRange>[26:26]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SNIFF_EN</name>
                <description>If 1, this channel's data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.

