apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            If 1, and INCR_READ is 0, this otherwise-unused combination causes the read address to be incremented by twice the transfer size, i.e. skipping over alternate addresses.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INCR_READ</name>
                <description>If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.

                            Generally this should be disabled for peripheral-to-memory transfers.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_SIZE</name>
                <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
                <bitRange>[3:2]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SIZE_BYTE</name>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_HALFWORD</name>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SIZE_WORD</name>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HIGH_PRIORITY</name>
                <description>HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.

                            This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>DMA Channel Enable. 
                            When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL3_WRITE_ADDR</name>
            <description>Alias for channel 0 WRITE_ADDR register</description>
            <addressOffset>0x34</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CH0_AL3_WRITE_ADDR</name>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL3_TRANS_COUNT</name>
            <description>Alias for channel 0 TRANS_COUNT register</description>
            <addressOffset>0x38</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CH0_AL3_TRANS_COUNT</name>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CH_AL3_READ_ADDR_TRIG</name>
            <description>Alias for channel 0 READ_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
            <addressOffset>0x3C</addressOffset>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>CH0_AL3_READ_ADDR_TRIG</name>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INTR</name>
          <description>Interrupt Status (raw)</description>
          <addressOffset>0x400</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTR</name>
              <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR or INTS0/1/2/3.

                            Channel interrupts can be routed to either of four system-level IRQs based on INTE0, INTE1, INTE2 and INTE3.

                            The multiple system-level interrupts might be used to allow NVIC IRQ preemption for more time-critical channels, to spread IRQ load across different cores, or to target IRQs to different security domains.

                            It is also valid to ignore the multiple IRQs, and just use INTE0/INTS0/IRQ 0.

                            If this register is accessed at a security/privilege level less than that of a given channel (as defined by that channel's SECCFG_CHx register), then that channel's interrupt status will read as 0, ignore writes.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE0</name>
          <description>Interrupt Enables for IRQ 0</description>
          <addressOffset>0x404</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTE0</name>
              <description>Set bit n to pass interrupts from channel n to DMA IRQ 0.

                            Note this bit has no effect if the channel security/privilege level, defined by SECCFG_CHx, is greater than the IRQ security/privilege defined by SECCFG_IRQ0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF0</name>
          <description>Force Interrupts</description>
          <addressOffset>0x408</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTF0</name>
              <description>Write 1s to force the corresponding bits in INTS0. The interrupt remains asserted until INTF0 is cleared.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS0</name>
          <description>Interrupt Status for IRQ 0</description>
          <addressOffset>0x40C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTS0</name>
              <description>Indicates active channel interrupt requests which are currently causing IRQ 0 to be asserted. 
                            Channel interrupts can be cleared by writing a bit mask here.

