apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            Channels with a security/privilege (SECCFG_CHx) greater SECCFG_IRQ0) read as 0 in this register, and ignore writes.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR1</name>
          <description>Interrupt Status (raw)</description>
          <addressOffset>0x410</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTR1</name>
              <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR or INTS0/1/2/3.

                            Channel interrupts can be routed to either of four system-level IRQs based on INTE0, INTE1, INTE2 and INTE3.

                            The multiple system-level interrupts might be used to allow NVIC IRQ preemption for more time-critical channels, to spread IRQ load across different cores, or to target IRQs to different security domains.

                            It is also valid to ignore the multiple IRQs, and just use INTE0/INTS0/IRQ 0.

                            If this register is accessed at a security/privilege level less than that of a given channel (as defined by that channel's SECCFG_CHx register), then that channel's interrupt status will read as 0, ignore writes.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE1</name>
          <description>Interrupt Enables for IRQ 1</description>
          <addressOffset>0x414</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTE1</name>
              <description>Set bit n to pass interrupts from channel n to DMA IRQ 1.

                            Note this bit has no effect if the channel security/privilege level, defined by SECCFG_CHx, is greater than the IRQ security/privilege defined by SECCFG_IRQ1.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF1</name>
          <description>Force Interrupts</description>
          <addressOffset>0x418</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTF1</name>
              <description>Write 1s to force the corresponding bits in INTS1. The interrupt remains asserted until INTF1 is cleared.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS1</name>
          <description>Interrupt Status for IRQ 1</description>
          <addressOffset>0x41C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTS1</name>
              <description>Indicates active channel interrupt requests which are currently causing IRQ 1 to be asserted. 
                            Channel interrupts can be cleared by writing a bit mask here.

                            Channels with a security/privilege (SECCFG_CHx) greater SECCFG_IRQ1) read as 0 in this register, and ignore writes.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR2</name>
          <description>Interrupt Status (raw)</description>
          <addressOffset>0x420</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTR2</name>
              <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR or INTS0/1/2/3.

                            Channel interrupts can be routed to either of four system-level IRQs based on INTE0, INTE1, INTE2 and INTE3.

                            The multiple system-level interrupts might be used to allow NVIC IRQ preemption for more time-critical channels, to spread IRQ load across different cores, or to target IRQs to different security domains.

                            It is also valid to ignore the multiple IRQs, and just use INTE0/INTS0/IRQ 0.

                            If this register is accessed at a security/privilege level less than that of a given channel (as defined by that channel's SECCFG_CHx register), then that channel's interrupt status will read as 0, ignore writes.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE2</name>
          <description>Interrupt Enables for IRQ 2</description>
          <addressOffset>0x424</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTE2</name>
              <description>Set bit n to pass interrupts from channel n to DMA IRQ 2.

                            Note this bit has no effect if the channel security/privilege level, defined by SECCFG_CHx, is greater than the IRQ security/privilege defined by SECCFG_IRQ2.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF2</name>
          <description>Force Interrupts</description>
          <addressOffset>0x428</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTF2</name>
              <description>Write 1s to force the corresponding bits in INTS2. The interrupt remains asserted until INTF2 is cleared.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS2</name>
          <description>Interrupt Status for IRQ 2</description>
          <addressOffset>0x42C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTS2</name>
              <description>Indicates active channel interrupt requests which are currently causing IRQ 2 to be asserted. 
                            Channel interrupts can be cleared by writing a bit mask here.

