apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>MPU_LAR6</name>
          <description>Limit address register for MPU region 6. Writable only from a Secure, Privileged context, with the exception of the P bit.</description>
          <addressOffset>0x538</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Limit address bits 31:5. Readable from any Privileged context, if and only if this region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a Secure, Privileged context.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>Determines the Secure/Non-secure (=1/0) status of addresses matching this region, if this region is enabled.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P</name>
              <description>Determines the Privileged/Unprivileged (=1/0) status of addresses matching this region, if this region is enabled. Writable from any Privileged context, if and only if the S bit is clear. Otherwise, writable only from a Secure, Privileged context.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Region enable. If 1, any address within range specified by the base address (BAR_ADDR) and limit address (LAR_ADDR) has the attributes specified by S and P.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_BAR7</name>
          <description>Base address register for MPU region 7. Writable only from a Secure, Privileged context.</description>
          <addressOffset>0x53C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>This MPU region matches addresses where addr[31:5] (the 27 most significant bits) are greater than or equal to BAR_ADDR, and less than or equal to LAR_ADDR.

                            Readable from any Privileged context, if and only if this region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a Secure, Privileged context.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_LAR7</name>
          <description>Limit address register for MPU region 7. Writable only from a Secure, Privileged context, with the exception of the P bit.</description>
          <addressOffset>0x540</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Limit address bits 31:5. Readable from any Privileged context, if and only if this region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a Secure, Privileged context.</description>
              <bitRange>[31:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>S</name>
              <description>Determines the Secure/Non-secure (=1/0) status of addresses matching this region, if this region is enabled.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>P</name>
              <description>Determines the Privileged/Unprivileged (=1/0) status of addresses matching this region, if this region is enabled. Writable from any Privileged context, if and only if the S bit is clear. Otherwise, writable only from a Secure, Privileged context.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Region enable. If 1, any address within range specified by the base address (BAR_ADDR) and limit address (LAR_ADDR) has the attributes specified by S and P.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x800</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x804</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x840</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH1_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x844</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH1_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x880</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH2_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x884</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH2_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x8C0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH3_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x8C4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH3_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x900</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH4_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x904</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH4_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x940</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH5_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x944</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH5_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x980</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH6_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x984</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH6_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x9C0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x9C4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH8_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xA00</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH8_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH8_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xA04</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH8_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xA40</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH9_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH9_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xA44</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH9_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH10_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xA80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH10_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH10_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xA84</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH10_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xAC0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH11_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH11_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xAC4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH11_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH12_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xB00</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH12_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH12_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xB04</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH12_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH13_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xB40</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH13_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH13_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xB44</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH13_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH14_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xB80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH14_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH14_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xB84</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH14_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0xBC0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH15_DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CH15_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0xBC4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH15_DBG_TCR</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
