apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>IRQ1_INTS</name>
          <description>Interrupt status after masking &amp; forcing for irq1</description>
          <addressOffset>0x10C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH11</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH10</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH9</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH8</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Control and data interface to SAR ADC</description>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_IRQ_FIFO</name>
        <value>35</value>
      </interrupt>
      <registers>
        <register>
          <name>CS</name>
          <description>ADC Control and Status</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RROBIN</name>
              <description>Round-robin sampling. 1 bit per channel. Set all bits to 0 to disable. 
                            Otherwise, the ADC will cycle through each enabled channel in a round-robin fashion. 
                            The first channel to be sampled will be the one currently indicated by AINSEL. 
                            AINSEL will be updated after each conversion with the newly-selected channel.</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AINSEL</name>
              <description>Select analog mux input. Updated automatically in round-robin mode. 
                            This is corrected for the package option so only ADC channels which are bonded are available, and in the correct order</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_STICKY</name>
              <description>Some past ADC conversion encountered an error. Write 1 to clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ERR</name>
              <description>The most recent ADC conversion encountered an error; result is undefined or noisy.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>READY</name>
              <description>1 if the ADC is ready to start a new conversion. Implies any previous conversion has completed. 
                            0 whilst conversion in progress.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>START_MANY</name>
              <description>Continuously perform conversions whilst this bit is 1. A new conversion will start immediately after the previous finishes.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START_ONCE</name>
              <description>Start a single conversion. Self-clearing. Ignored if start_many is asserted.</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TS_EN</name>
              <description>Power on temperature sensor. 1 - enabled. 0 - disabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Power on ADC and enable its clock. 
                            1 - enabled. 0 - disabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result of most recent ADC conversion</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESULT</name>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCS</name>
          <description>FIFO control and status</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THRESH</name>
              <description>DREQ/IRQ asserted when level &gt;= threshold</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL</name>
              <description>The number of conversion results currently waiting in the FIFO</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVER</name>
              <description>1 if the FIFO has been overflowed. Write 1 to clear.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>UNDER</name>
              <description>1 if the FIFO has been underflowed. Write 1 to clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FULL</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DREQ_EN</name>
              <description>If 1: assert DMA requests when FIFO contains data</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>If 1: conversion error bit appears in the FIFO alongside the result</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHIFT</name>
              <description>If 1: FIFO results are right-shifted to be one byte in size. Enables DMA to byte buffers.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>If 1: write result to the FIFO after each conversion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO</name>
          <description>Conversion result FIFO</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ERR</name>
              <description>1 if this particular sample experienced a conversion error. Remains in the same location if the sample is shifted.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
            <field>
              <name>VAL</name>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV</name>
          <description>Clock divider. If non-zero, CS_START_MANY will start conversions 
                    at regular intervals rather than back-to-back. 
                    The divider is reset when either of these fields are written. 
                    Total period is 1 + INT + FRAC / 256</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>Integer part of clock divisor.</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Fractional part of clock divisor. First-order delta-sigma.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Raw Interrupts</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level. 
                            This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level. 
                            This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <description>Interrupt Force</description>
          <addressOffset>0x1C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level. 
                            This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS</name>
          <description>Interrupt status after masking &amp; forcing</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level. 
                            This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
