apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            Reset value: 0x0</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_RESTART_DET interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_RESTART_DET interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_GEN_CALL</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_GEN_CALL bit.

                            Reset value: 0x0</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_GEN_CALL interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_GEN_CALL interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_START_DET</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_START_DET bit.

                            Reset value: 0x0</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_START_DET interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_START_DET interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_STOP_DET</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_STOP_DET bit.

                            Reset value: 0x0</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_STOP_DET interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_STOP_DET interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_ACTIVITY</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_ACTIVITY bit.

                            Reset value: 0x0</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_ACTIVITY interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_ACTIVITY interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_RX_DONE</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_DONE bit.

                            Reset value: 0x0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_RX_DONE interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_RX_DONE interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_TX_ABRT</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_ABRT bit.

                            Reset value: 0x0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_TX_ABRT interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_TX_ABRT interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_RD_REQ</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_RD_REQ bit.

                            Reset value: 0x0</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>R_RD_REQ interrupt is inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>R_RD_REQ interrupt is active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R_TX_EMPTY</name>
              <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_EMPTY bit.

