apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PIO0">
      <name>PIO1</name>
      <baseAddress>0x50300000</baseAddress>
      <interrupt>
        <name>PIO1_IRQ_0</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>PIO1_IRQ_1</name>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PIO0">
      <name>PIO2</name>
      <baseAddress>0x50400000</baseAddress>
      <interrupt>
        <name>PIO2_IRQ_0</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>PIO2_IRQ_1</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>BUSCTRL</name>
      <description>Register block for busfabric control signals and performance counters</description>
      <baseAddress>0x40068000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BUS_PRIORITY</name>
          <description>Set the priority of each master for bus arbitration.</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_W</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_R</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC1</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC0</name>
              <description>0 - low priority, 1 - high priority</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_PRIORITY_ACK</name>
          <description>Bus priority acknowledge</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUS_PRIORITY_ACK</name>
              <description>Goes to 1 once all arbiters have registered the new global priority levels. 
                            Arbiters update their local priority when servicing a new nonsequential access. 
                            In normal circumstances this will happen almost immediately.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFCTR_EN</name>
          <description>Enable the performance counters. If 0, the performance counters do not increment. This can be used to precisely start/stop event sampling around the profiled section of code.

                    The performance counters are initially disabled, to save energy.</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERFCTR_EN</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFCTR0</name>
          <description>Bus fabric performance counter 0</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERFCTR0</name>
              <description>Busfabric saturating performance counter 0 
                            Count some event signal from the busfabric arbiters, if PERFCTR_EN is set. 
                            Write any value to clear. Select an event to count using PERFSEL0</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFSEL0</name>
          <description>Bus fabric performance event select for PERFCTR0</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>PERFSEL0</name>
              <description>Select an event for PERFCTR0. For each downstream port of the main crossbar, four events are available: ACCESS, an access took place; ACCESS_CONTESTED, an access took place that previously stalled due to contention from other masters; STALL_DOWNSTREAM, count cycles where any master stalled due to a stall on the downstream bus; STALL_UPSTREAM, count cycles where any master stalled for any reason, including contention from other masters.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>siob_proc1_stall_upstream</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc1_stall_downstream</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc1_access_contested</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc1_access</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc0_stall_upstream</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc0_stall_downstream</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc0_access_contested</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>siob_proc0_access</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb_stall_upstream</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb_stall_downstream</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb_access_contested</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb_access</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_stall_upstream</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_stall_downstream</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_access_contested</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_access</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram9_stall_upstream</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram9_stall_downstream</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram9_access_contested</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram9_access</name>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram8_stall_upstream</name>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram8_stall_downstream</name>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram8_access_contested</name>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram8_access</name>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram7_stall_upstream</name>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram7_stall_downstream</name>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram7_access_contested</name>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram7_access</name>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram6_stall_upstream</name>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram6_stall_downstream</name>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram6_access_contested</name>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram6_access</name>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_stall_upstream</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_stall_downstream</name>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_access_contested</name>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_access</name>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_stall_upstream</name>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_stall_downstream</name>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_access_contested</name>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_access</name>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_stall_upstream</name>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_stall_downstream</name>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_access_contested</name>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_access</name>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_stall_upstream</name>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_stall_downstream</name>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_access_contested</name>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_access</name>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_stall_upstream</name>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_stall_downstream</name>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_access_contested</name>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_access</name>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_stall_upstream</name>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_stall_downstream</name>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_access_contested</name>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_access</name>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main1_stall_upstream</name>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main1_stall_downstream</name>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main1_access_contested</name>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main1_access</name>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main0_stall_upstream</name>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main0_stall_downstream</name>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main0_access_contested</name>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main0_access</name>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_stall_upstream</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_stall_downstream</name>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_access_contested</name>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_access</name>
                  <value>67</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERFCTR1</name>
          <description>Bus fabric performance counter 1</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERFCTR1</name>
              <description>Busfabric saturating performance counter 1 
                            Count some event signal from the busfabric arbiters, if PERFCTR_EN is set. 
                            Write any value to clear. Select an event to count using PERFSEL1</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
