apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>FIFO_WR</name>
          <description>Write access to this core's TX FIFO</description>
          <addressOffset>0x54</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO_WR</name>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_RD</name>
          <description>Read access to this core's RX FIFO</description>
          <addressOffset>0x58</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>FIFO_RD</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SPINLOCK_ST</name>
          <description>Spinlock state 
                    A bitmap containing the state of all 32 spinlocks (1=locked). 
                    Mainly intended for debugging.</description>
          <addressOffset>0x5C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPINLOCK_ST</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_ACCUM0</name>
          <description>Read/write access to accumulator 0</description>
          <addressOffset>0x80</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_ACCUM0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_ACCUM1</name>
          <description>Read/write access to accumulator 1</description>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_ACCUM1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_BASE0</name>
          <description>Read/write access to BASE0 register.</description>
          <addressOffset>0x88</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_BASE0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_BASE1</name>
          <description>Read/write access to BASE1 register.</description>
          <addressOffset>0x8C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_BASE1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_BASE2</name>
          <description>Read/write access to BASE2 register.</description>
          <addressOffset>0x90</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_BASE2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_POP_LANE0</name>
          <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
          <addressOffset>0x94</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_POP_LANE0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_POP_LANE1</name>
          <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
          <addressOffset>0x98</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_POP_LANE1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_POP_FULL</name>
          <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
          <addressOffset>0x9C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_POP_FULL</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_PEEK_LANE0</name>
          <description>Read LANE0 result, without altering any internal state (PEEK).</description>
          <addressOffset>0xA0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_PEEK_LANE0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_PEEK_LANE1</name>
          <description>Read LANE1 result, without altering any internal state (PEEK).</description>
          <addressOffset>0xA4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_PEEK_LANE1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_PEEK_FULL</name>
          <description>Read FULL result, without altering any internal state (PEEK).</description>
          <addressOffset>0xA8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_PEEK_FULL</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_CTRL_LANE0</name>
          <description>Control register for lane 0</description>
          <addressOffset>0xAC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVERF</name>
              <description>Set if either OVERF0 or OVERF1 is set.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERF1</name>
              <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVERF0</name>
              <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BLEND</name>
              <description>Only present on INTERP0 on each core. If BLEND mode is enabled: 
                            - LANE1 result is a linear interpolation between BASE0 and BASE1, controlled 
                            by the 8 LSBs of lane 1 shift and mask value (a fractional number between 
                            0 and 255/256ths) 
                            - LANE0 result does not have BASE0 added (yields only the 8 LSBs of lane 1 shift+mask value) 
                            - FULL result does not have lane 1 shift+mask value added (BASE2 + lane 0 shift+mask) 
                            LANE1 SIGNED flag controls whether the interpolation is signed or unsigned.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MSB</name>
              <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD_RAW</name>
              <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CROSS_RESULT</name>
              <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CROSS_INPUT</name>
              <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGNED</name>
              <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_MSB</name>
              <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_LSB</name>
              <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHIFT</name>
              <description>Right-rotate applied to accumulator before masking. By appropriately configuring the masks, left and right shifts can be synthesised.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_CTRL_LANE1</name>
          <description>Control register for lane 1</description>
          <addressOffset>0xB0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FORCE_MSB</name>
              <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD_RAW</name>
              <description>If 1, mask + shift is bypassed for LANE1 result. This does not affect FULL result.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CROSS_RESULT</name>
              <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CROSS_INPUT</name>
              <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGNED</name>
              <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE1, and LANE1 PEEK/POP appear extended to 32 bits when read by processor.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_MSB</name>
              <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_LSB</name>
              <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHIFT</name>
              <description>Right-rotate applied to accumulator before masking. By appropriately configuring the masks, left and right shifts can be synthesised.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_ACCUM0_ADD</name>
          <description>Values written here are atomically added to ACCUM0 
                    Reading yields lane 0's raw shift and mask value (BASE0 not added).</description>
          <addressOffset>0xB4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_ACCUM0_ADD</name>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_ACCUM1_ADD</name>
          <description>Values written here are atomically added to ACCUM1 
                    Reading yields lane 1's raw shift and mask value (BASE1 not added).</description>
          <addressOffset>0xB8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_ACCUM1_ADD</name>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP0_BASE_1AND0</name>
          <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously. 
                    Each half is sign-extended to 32 bits if that lane's SIGNED flag is set.</description>
          <addressOffset>0xBC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP0_BASE_1AND0</name>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_ACCUM0</name>
          <description>Read/write access to accumulator 0</description>
          <addressOffset>0xC0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_ACCUM0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_ACCUM1</name>
          <description>Read/write access to accumulator 1</description>
          <addressOffset>0xC4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_ACCUM1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_BASE0</name>
          <description>Read/write access to BASE0 register.</description>
          <addressOffset>0xC8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_BASE0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_BASE1</name>
          <description>Read/write access to BASE1 register.</description>
          <addressOffset>0xCC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_BASE1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_BASE2</name>
          <description>Read/write access to BASE2 register.</description>
          <addressOffset>0xD0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_BASE2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_POP_LANE0</name>
          <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
          <addressOffset>0xD4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_POP_LANE0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_POP_LANE1</name>
          <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
          <addressOffset>0xD8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_POP_LANE1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_POP_FULL</name>
          <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
          <addressOffset>0xDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_POP_FULL</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_PEEK_LANE0</name>
          <description>Read LANE0 result, without altering any internal state (PEEK).</description>
          <addressOffset>0xE0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_PEEK_LANE0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_PEEK_LANE1</name>
          <description>Read LANE1 result, without altering any internal state (PEEK).</description>
          <addressOffset>0xE4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_PEEK_LANE1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERP1_PEEK_FULL</name>
          <description>Read FULL result, without altering any internal state (PEEK).</description>
          <addressOffset>0xE8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERP1_PEEK_FULL</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
