apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    Write 1 to a bit to set the corresponding bit in DOORBELL_IN on the opposite core. This raises the opposite core's doorbell interrupt.

                    Read to get the status of the doorbells currently asserted on the opposite core. This is equivalent to that core reading its own DOORBELL_IN status.</description>
          <addressOffset>0x180</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOORBELL_OUT_SET</name>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOORBELL_OUT_CLR</name>
          <description>Clear doorbells which have been posted to the opposite core. This register is intended for debugging and initialisation purposes.

                    Writing 1 to a bit in DOORBELL_OUT_CLR clears the corresponding bit in DOORBELL_IN on the opposite core. Clearing all bits will cause that core's doorbell interrupt to deassert. Since the usual order of events is for software to send events using DOORBELL_OUT_SET, and acknowledge incoming events by writing to DOORBELL_IN_CLR, this register should be used with caution to avoid race conditions.

                    Reading returns the status of the doorbells currently asserted on the other core, i.e. is equivalent to that core reading its own DOORBELL_IN status.</description>
          <addressOffset>0x184</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOORBELL_OUT_CLR</name>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOORBELL_IN_SET</name>
          <description>Write 1s to trigger doorbell interrupts on this core. Read to get status of doorbells currently asserted on this core.</description>
          <addressOffset>0x188</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOORBELL_IN_SET</name>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOORBELL_IN_CLR</name>
          <description>Check and acknowledge doorbells posted to this core. This core's doorbell interrupt is asserted when any bit in this register is 1.

                    Write 1 to each bit to clear that bit. The doorbell interrupt deasserts once all bits are cleared. Read to get status of doorbells currently asserted on this core.</description>
          <addressOffset>0x18C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOORBELL_IN_CLR</name>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PERI_NONSEC</name>
          <description>Detach certain core-local peripherals from Secure SIO, and attach them to Non-secure SIO, so that Non-secure software can use them. Attempting to access one of these peripherals from the Secure SIO when it is attached to the Non-secure SIO, or vice versa, will generate a bus error.

                    This register is per-core, and is only present on the Secure SIO.

                    Most SIO hardware is duplicated across the Secure and Non-secure SIO, so is not listed in this register.</description>
          <addressOffset>0x190</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS</name>
              <description>IF 1, detach TMDS encoder (of this core) from the Secure SIO, and attach to the Non-secure SIO.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERP1</name>
              <description>If 1, detach interpolator 1 (of this core) from the Secure SIO, and attach to the Non-secure SIO.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERP0</name>
              <description>If 1, detach interpolator 0 (of this core) from the Secure SIO, and attach to the Non-secure SIO.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RISCV_SOFTIRQ</name>
          <description>Control the assertion of the standard software interrupt (MIP.MSIP) on the RISC-V cores.

                    Unlike the RISC-V timer, this interrupt is not routed to a normal system-level interrupt line, so can not be used by the Arm cores.

                    It is safe for both cores to write to this register on the same cycle. The set/clear effect is accumulated across both cores, and then applied. If a flag is both set and cleared on the same cycle, only the set takes effect.</description>
          <addressOffset>0x1A0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CORE1_CLR</name>
              <description>Write 1 to atomically clear the core 1 software interrupt flag. Read to get the status of this flag.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_CLR</name>
              <description>Write 1 to atomically clear the core 0 software interrupt flag. Read to get the status of this flag.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_SET</name>
              <description>Write 1 to atomically set the core 1 software interrupt flag. Read to get the status of this flag.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_SET</name>
              <description>Write 1 to atomically set the core 0 software interrupt flag. Read to get the status of this flag.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIME_CTRL</name>
          <description>Control register for the RISC-V 64-bit Machine-mode timer. This timer is only present in the Secure SIO, so is only accessible to an Arm core in Secure mode or a RISC-V core in Machine mode.

