apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            For example, for RGB565, green is bits 10:5, so should be right-rotated by 3 bits to align with bits 7:2 of the encoder input.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>L0_ROT</name>
              <description>Right-rotate the 16 LSBs of the colour accumulator by 0-15 bits, in order to get the MSB of the lane 0 (blue) colour data aligned with the MSB of the 8-bit encoder input.

                            For example, for RGB565 (red most significant), blue is bits 4:0, so should be right-rotated by 13 to align with bits 7:3 of the encoder input.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_WDATA</name>
          <description>Write-only access to the TMDS colour data register.</description>
          <addressOffset>0x1C4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_WDATA</name>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_PEEK_SINGLE</name>
          <description>Get the encoding of one pixel's worth of colour data, packed into a 32-bit value (3x10-bit symbols).

                    The PEEK alias does not shift the colour register when read, but still advances the running DC balance state of each encoder. This is useful for pixel doubling.</description>
          <addressOffset>0x1C8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_PEEK_SINGLE</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_POP_SINGLE</name>
          <description>Get the encoding of one pixel's worth of colour data, packed into a 32-bit value. The packing is 5 chunks of 3 lanes times 2 bits (30 bits total). Each chunk contains two bits of a TMDS symbol per lane. This format is intended for shifting out with the HSTX peripheral on RP2350.

                    The POP alias shifts the colour register when read, as well as advancing the running DC balance state of each encoder.</description>
          <addressOffset>0x1CC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_POP_SINGLE</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_PEEK_DOUBLE_L0</name>
          <description>Get lane 0 of the encoding of two pixels' worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The PEEK alias does not shift the colour register when read, but still advances the lane 0 DC balance state. This is useful if all 3 lanes' worth of encode are to be read at once, rather than processing the entire scanline for one lane before moving to the next lane.</description>
          <addressOffset>0x1D0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_PEEK_DOUBLE_L0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_POP_DOUBLE_L0</name>
          <description>Get lane 0 of the encoding of two pixels' worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The POP alias shifts the colour register when read, according to the values of PIX_SHIFT and PIX2_NOSHIFT.</description>
          <addressOffset>0x1D4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_POP_DOUBLE_L0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_PEEK_DOUBLE_L1</name>
          <description>Get lane 1 of the encoding of two pixels' worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The PEEK alias does not shift the colour register when read, but still advances the lane 1 DC balance state. This is useful if all 3 lanes' worth of encode are to be read at once, rather than processing the entire scanline for one lane before moving to the next lane.</description>
          <addressOffset>0x1D8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_PEEK_DOUBLE_L1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_POP_DOUBLE_L1</name>
          <description>Get lane 1 of the encoding of two pixels' worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The POP alias shifts the colour register when read, according to the values of PIX_SHIFT and PIX2_NOSHIFT.</description>
          <addressOffset>0x1DC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_POP_DOUBLE_L1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_PEEK_DOUBLE_L2</name>
          <description>Get lane 2 of the encoding of two pixels' worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

