apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    The PEEK alias does not shift the colour register when read, but still advances the lane 2 DC balance state. This is useful if all 3 lanes' worth of encode are to be read at once, rather than processing the entire scanline for one lane before moving to the next lane.</description>
          <addressOffset>0x1E0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_PEEK_DOUBLE_L2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>TMDS_POP_DOUBLE_L2</name>
          <description>Get lane 2 of the encoding of two pixels' worth of colour data. Two 10-bit TMDS symbols are packed at the bottom of a 32-bit word.

                    The POP alias shifts the colour register when read, according to the values of PIX_SHIFT and PIX2_NOSHIFT.</description>
          <addressOffset>0x1E4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDS_POP_DOUBLE_L2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="SIO">
      <name>SIO_NS</name>
      <baseAddress>0xD0020000</baseAddress>
    </peripheral>
    <peripheral>
      <name>BOOTRAM</name>
      <description>Additional registers mapped adjacent to the bootram, for use by the bootrom.</description>
      <baseAddress>0x400E0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x82C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WRITE_ONCE0</name>
          <description>This registers always ORs writes into its current contents. Once a bit is set, it can only be cleared by a reset.</description>
          <addressOffset>0x800</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRITE_ONCE0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_ONCE1</name>
          <description>This registers always ORs writes into its current contents. Once a bit is set, it can only be cleared by a reset.</description>
          <addressOffset>0x804</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WRITE_ONCE1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK_STAT</name>
          <description>Bootlock status register. 1=unclaimed, 0=claimed. These locks function identically to the SIO spinlocks, but are reserved for bootrom use.</description>
          <addressOffset>0x808</addressOffset>
          <resetValue>0x000000FF</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK_STAT</name>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK0</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x80C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK1</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x810</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK2</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x814</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK3</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x818</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK3</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK4</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x81C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK4</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK5</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x820</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK5</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK6</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x824</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK6</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOCK7</name>
          <description>Read to claim and check. Write to unclaim. The value returned on successful claim is 1 &lt;&lt; n, and on failed claim is zero.</description>
          <addressOffset>0x828</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOTLOCK7</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
