apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRNG</name>
      <description>ARM TrustZone RNG register block</description>
      <baseAddress>0x400F0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1EC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TRNG_IRQ</name>
        <value>39</value>
      </interrupt>
      <registers>
        <register>
          <name>RNG_IMR</name>
          <description>Interrupt masking.</description>
          <addressOffset>0x100</addressOffset>
          <resetValue>0x0000000F</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VN_ERR_INT_MASK</name>
              <description>1'b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRNGT_ERR_INT_MASK</name>
              <description>1'b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOCORR_ERR_INT_MASK</name>
              <description>1'b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EHR_VALID_INT_MASK</name>
              <description>1'b1-mask interrupt, no interrupt will be generated. See RNG_ISR for an explanation on this interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_ISR</name>
          <description>RNG status register. If corresponding RNG_IMR bit is unmasked, an interrupt will be generated.</description>
          <addressOffset>0x104</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VN_ERR</name>
              <description>1'b1 indicates Von Neuman error. Error in von Neuman occurs if 32 consecutive collected bits are identical, ZERO or ONE.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRNGT_ERR</name>
              <description>1'b1 indicates CRNGT in the RNG test failed. Failure occurs when two consecutive blocks of 16 collected bits are equal.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTOCORR_ERR</name>
              <description>1'b1 indicates Autocorrelation test failed four times in a row. When set, RNG cease from functioning until next reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EHR_VALID</name>
              <description>1'b1 indicates that 192 bits have been collected in the RNG, and are ready to be read.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_ICR</name>
          <description>Interrupt/status bit clear Register.</description>
          <addressOffset>0x108</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VN_ERR</name>
              <description>Write 1'b1 - clear corresponding bit in RNG_ISR.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRNGT_ERR</name>
              <description>Write 1'b1 - clear corresponding bit in RNG_ISR.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOCORR_ERR</name>
              <description>Cannot be cleared by SW! Only RNG reset clears this bit.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EHR_VALID</name>
              <description>Write 1'b1 - clear corresponding bit in RNG_ISR.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_CONFIG</name>
          <description>Selecting the inverter-chain length.</description>
          <addressOffset>0x10C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RND_SRC_SEL</name>
              <description>Selects the number of inverters (out of four possible selections) in the ring oscillator (the entropy source).</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_VALID</name>
          <description>192 bit collection indication.</description>
          <addressOffset>0x110</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EHR_VALID</name>
              <description>1'b1 indicates that collection of bits in the RNG is completed, and data can be read from EHR_DATA register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EHR_DATA0</name>
          <description>RNG collected bits.</description>
          <addressOffset>0x114</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EHR_DATA0</name>
              <description>Bits [31:0] of Entropy Holding Register (EHR) - RNG output register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EHR_DATA1</name>
          <description>RNG collected bits.</description>
          <addressOffset>0x118</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EHR_DATA1</name>
              <description>Bits [63:32] of Entropy Holding Register (EHR) - RNG output register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EHR_DATA2</name>
          <description>RNG collected bits.</description>
          <addressOffset>0x11C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EHR_DATA2</name>
              <description>Bits [95:64] of Entropy Holding Register (EHR) - RNG output register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EHR_DATA3</name>
          <description>RNG collected bits.</description>
          <addressOffset>0x120</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EHR_DATA3</name>
              <description>Bits [127:96] of Entropy Holding Register (EHR) - RNG output register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EHR_DATA4</name>
          <description>RNG collected bits.</description>
          <addressOffset>0x124</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EHR_DATA4</name>
              <description>Bits [159:128] of Entropy Holding Register (EHR) - RNG output register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EHR_DATA5</name>
          <description>RNG collected bits.</description>
          <addressOffset>0x128</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EHR_DATA5</name>
              <description>Bits [191:160] of Entropy Holding Register (EHR) - RNG output register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_SOURCE_ENABLE</name>
          <description>Enable signal for the random source.</description>
          <addressOffset>0x12C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RND_SRC_EN</name>
              <description>* 1'b1 - entropy source is enabled. *1'b0 - entropy source is disabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLE_CNT1</name>
          <description>Counts clocks between sampling of random bit.</description>
          <addressOffset>0x130</addressOffset>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>SAMPLE_CNTR1</name>
              <description>Sets the number of rng_clk cycles between two consecutive ring oscillator samples. Note! If the Von-Neuman is bypassed, the minimum value for sample counter must not be less then decimal seventeen</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCORR_STATISTIC</name>
          <description>Statistic about Autocorrelation test activations.</description>
          <addressOffset>0x134</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTOCORR_FAILS</name>
              <description>Count each time an autocorrelation test fails. Any write to the register reset the counter. Stop collecting statistic if one of the counters reached the limit.</description>
              <bitRange>[21:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOCORR_TRYS</name>
              <description>Count each time an autocorrelation test starts. Any write to the register reset the counter. Stop collecting statistic if one of the counters reached the limit.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_DEBUG_CONTROL</name>
          <description>Debug register.</description>
          <addressOffset>0x138</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUTO_CORRELATE_BYPASS</name>
              <description>When set, the autocorrelation test in the TRNG module is bypassed.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRNG_CRNGT_BYPASS</name>
              <description>When set, the CRNGT test in the RNG is bypassed.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VNC_BYPASS</name>
              <description>When set, the Von-Neuman balancer is bypassed (including the 32 consecutive bits test).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED</name>
              <description>N/A</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_SW_RESET</name>
          <description>Generate internal SW reset within the RNG block.</description>
          <addressOffset>0x140</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_SW_RESET</name>
              <description>Writing 1'b1 to this register causes an internal RNG reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_DEBUG_EN_INPUT</name>
          <description>Enable the RNG debug mode</description>
          <addressOffset>0x1B4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RNG_DEBUG_EN</name>
              <description>* 1'b1 - debug mode is enabled. *1'b0 - debug mode is disabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRNG_BUSY</name>
          <description>RNG Busy indication.</description>
          <addressOffset>0x1B8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_BUSY</name>
              <description>Reflects rng_busy status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_BITS_COUNTER</name>
          <description>Reset the counter of collected bits in the RNG.</description>
          <addressOffset>0x1BC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RST_BITS_COUNTER</name>
              <description>Writing any value to this address will reset the bits counter and RNG valid registers. RND_SORCE_ENABLE register must be unset in order for the reset to take place.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_VERSION</name>
          <description>Displays the version settings of the TRNG.</description>
          <addressOffset>0x1C0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RNG_USE_5_SBOXES</name>
              <description>* 1'b1 - 5 SBOX AES. *1'b0 - 20 SBOX AES</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RESEEDING_EXISTS</name>
              <description>* 1'b1 - Exists. *1'b0 - Does not exist</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>KAT_EXISTS</name>
              <description>* 1'b1 - Exists. *1'b0 - Does not exist</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PRNG_EXISTS</name>
              <description>* 1'b1 - Exists. *1'b0 - Does not exist</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_TESTS_BYPASS_EN</name>
              <description>* 1'b1 - Exists. *1'b0 - Does not exist</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTOCORR_EXISTS</name>
              <description>* 1'b1 - Exists. *1'b0 - Does not exist</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRNGT_EXISTS</name>
              <description>* 1'b1 - Exists. *1'b0 - Does not exist</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EHR_WIDTH_192</name>
              <description>* 1'b1 - 192-bit EHR. *1'b0 - 128-bit EHR</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_BIST_CNTR_0</name>
          <description>Collected BIST results.</description>
          <addressOffset>0x1E0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROSC_CNTR_VAL</name>
              <description>Reflects the results of RNG BIST counter.</description>
              <bitRange>[21:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_BIST_CNTR_1</name>
          <description>Collected BIST results.</description>
          <addressOffset>0x1E4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROSC_CNTR_VAL</name>
              <description>Reflects the results of RNG BIST counter.</description>
              <bitRange>[21:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNG_BIST_CNTR_2</name>
          <description>Collected BIST results.</description>
          <addressOffset>0x1E8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>RESERVED</description>
              <bitRange>[31:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROSC_CNTR_VAL</name>
              <description>Reflects the results of RNG BIST counter.</description>
              <bitRange>[21:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
