apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK12</name>
          <description>Software lock register for page 12.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x30</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK13</name>
          <description>Software lock register for page 13.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x34</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK14</name>
          <description>Software lock register for page 14.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x38</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK15</name>
          <description>Software lock register for page 15.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x3C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK16</name>
          <description>Software lock register for page 16.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x40</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK17</name>
          <description>Software lock register for page 17.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x44</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK18</name>
          <description>Software lock register for page 18.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x48</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK19</name>
          <description>Software lock register for page 19.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x4C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK20</name>
          <description>Software lock register for page 20.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x50</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK21</name>
          <description>Software lock register for page 21.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x54</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK22</name>
          <description>Software lock register for page 22.

