apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x84</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK34</name>
          <description>Software lock register for page 34.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x88</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK35</name>
          <description>Software lock register for page 35.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x8C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK36</name>
          <description>Software lock register for page 36.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x90</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK37</name>
          <description>Software lock register for page 37.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x94</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK38</name>
          <description>Software lock register for page 38.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x98</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK39</name>
          <description>Software lock register for page 39.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0x9C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK40</name>
          <description>Software lock register for page 40.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xA0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK41</name>
          <description>Software lock register for page 41.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xA4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK42</name>
          <description>Software lock register for page 42.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xA8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK43</name>
          <description>Software lock register for page 43.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xAC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK44</name>
          <description>Software lock register for page 44.

