apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xDC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK56</name>
          <description>Software lock register for page 56.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xE0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK57</name>
          <description>Software lock register for page 57.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xE4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK58</name>
          <description>Software lock register for page 58.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xE8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK59</name>
          <description>Software lock register for page 59.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xEC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK60</name>
          <description>Software lock register for page 60.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xF0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK61</name>
          <description>Software lock register for page 61.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xF4</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK62</name>
          <description>Software lock register for page 62.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xF8</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_LOCK63</name>
          <description>Software lock register for page 63.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
          <addressOffset>0xFC</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NSEC</name>
              <description>Non-secure lock status. Writes are OR'd with the current value.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC</name>
              <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read_write</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>read_only</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inaccessible</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_INSTR</name>
          <description>Dispatch instructions to the SBPI interface, used for programming the OTP fuses.</description>
          <addressOffset>0x100</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXEC</name>
              <description>Execute instruction</description>
              <bitRange>[30:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>IS_WR</name>
              <description>Payload type is write</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HAS_PAYLOAD</name>
              <description>Instruction has payload (data to be written or to be read)</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAYLOAD_SIZE_M1</name>
              <description>Instruction payload size in bytes minus 1</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TARGET</name>
              <description>Instruction target, it can be PMC (0x3a) or DAP (0x02)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD</name>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHORT_WDATA</name>
              <description>wdata to be used only when payload_size_m1=0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_WDATA_0</name>
          <description>SBPI write payload bytes 3..0</description>
          <addressOffset>0x104</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_WDATA_0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_WDATA_1</name>
          <description>SBPI write payload bytes 7..4</description>
          <addressOffset>0x108</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_WDATA_1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_WDATA_2</name>
          <description>SBPI write payload bytes 11..8</description>
          <addressOffset>0x10C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_WDATA_2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_WDATA_3</name>
          <description>SBPI write payload bytes 15..12</description>
          <addressOffset>0x110</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_WDATA_3</name>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_RDATA_0</name>
          <description>Read payload bytes 3..0. Once read, the data in the register will automatically clear to 0.</description>
          <addressOffset>0x114</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_RDATA_0</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_RDATA_1</name>
          <description>Read payload bytes 7..4. Once read, the data in the register will automatically clear to 0.</description>
          <addressOffset>0x118</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_RDATA_1</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_RDATA_2</name>
          <description>Read payload bytes 11..8. Once read, the data in the register will automatically clear to 0.</description>
          <addressOffset>0x11C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_RDATA_2</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
