apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>SBPI_RDATA_3</name>
          <description>Read payload bytes 15..12. Once read, the data in the register will automatically clear to 0.</description>
          <addressOffset>0x120</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SBPI_RDATA_3</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
              <readAction>modify</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SBPI_STATUS</name>
          <addressOffset>0x124</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MISO</name>
              <description>SBPI MISO (master in - slave out): response from SBPI</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FLAG</name>
              <description>SBPI flag</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INSTR_MISS</name>
              <description>Last instruction missed (dropped), as the previous has not finished running</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>INSTR_DONE</name>
              <description>Last instruction done</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RDATA_VLD</name>
              <description>Read command has returned data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USR</name>
          <description>Controls for APB data read interface (USER interface)</description>
          <addressOffset>0x128</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PD</name>
              <description>Power-down; 1 disables current reference. Must be 0 to read data from the OTP.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DCTRL</name>
              <description>1 enables USER interface; 0 disables USER interface (enables SBPI).

                            This bit must be cleared before performing any SBPI access, such as when programming the OTP. The APB data read interface (USER interface) will be inaccessible during this time, and will return a bus error if any read is attempted.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG</name>
          <description>Debug for OTP power-on state machine</description>
          <addressOffset>0x12C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CUSTOMER_RMA_FLAG</name>
              <description>The chip is in RMA mode</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PSM_STATE</name>
              <description>Monitor the PSM FSM's state</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROSC_UP</name>
              <description>Ring oscillator is up and running</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ROSC_UP_SEEN</name>
              <description>Ring oscillator was seen up and running</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BOOT_DONE</name>
              <description>PSM boot done status flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PSM_DONE</name>
              <description>PSM done status flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BIST</name>
          <description>During BIST, count address locations that have at least one leaky bit</description>
          <addressOffset>0x134</addressOffset>
          <resetValue>0x0FFF0000</resetValue>
          <fields>
            <field>
              <name>CNT_FAIL</name>
              <description>Flag if the count of address locations with at least one leaky bit exceeds cnt_max</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CNT_CLR</name>
              <description>Clear counter before use</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CNT_ENA</name>
              <description>Enable the counter before the BIST function is initiated</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MAX</name>
              <description>The cnt_fail flag will be set if the number of leaky locations exceeds this number</description>
              <bitRange>[27:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>Number of locations that have at least one leaky bit. Note: This count is true only if the BIST was initiated without the fix option.</description>
              <bitRange>[12:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRT_KEY_W0</name>
          <description>Word 0 (bits 31..0) of the key. Write only, read returns 0x0</description>
          <addressOffset>0x138</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRT_KEY_W0</name>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRT_KEY_W1</name>
          <description>Word 1 (bits 63..32) of the key. Write only, read returns 0x0</description>
          <addressOffset>0x13C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRT_KEY_W1</name>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRT_KEY_W2</name>
          <description>Word 2 (bits 95..64) of the key. Write only, read returns 0x0</description>
          <addressOffset>0x140</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRT_KEY_W2</name>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRT_KEY_W3</name>
          <description>Word 3 (bits 127..96) of the key. Write only, read returns 0x0</description>
          <addressOffset>0x144</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CRT_KEY_W3</name>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRITICAL</name>
          <description>Quickly check values of critical flags read during boot up</description>
          <addressOffset>0x148</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RISCV_DISABLE</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARM_DISABLE</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GLITCH_DETECTOR_SENS</name>
              <bitRange>[6:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GLITCH_DETECTOR_ENABLE</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEFAULT_ARCHSEL</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_DISABLE</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_DEBUG_DISABLE</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_ENABLE</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_VALID</name>
          <description>Which keys were valid (enrolled) at boot time</description>
          <addressOffset>0x14C</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY_VALID</name>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGEN</name>
          <description>Enable a debug feature that has been disabled. Debug features are disabled if one of the relevant critical boot flags is set in OTP (DEBUG_DISABLE or SECURE_DEBUG_DISABLE), OR if a debug key is marked valid in OTP, and the matching key value has not been supplied over SWD.

                    Specifically:

