apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    This should be configured to produce an exact 48 MHz based on the crystal oscillator frequency. User mode software may also use this value to calculate the expected crystal frequency based on an assumed 48 MHz PLL output.

                    If no configuration is given, the crystal is assumed to be 12 MHz.

                    The PLL frequency can be calculated as:

                    PLL out = (XOSC frequency / (REFDIV+1)) x FBDIV / (POSTDIV1 x POSTDIV2)

                    Conversely the crystal frequency can be calculated as:

                    XOSC frequency = 48 MHz x (REFDIV+1) x (POSTDIV1 x POSTDIV2) / FBDIV

                    (Note the  +1 on REFDIV is because the value stored in this OTP location is the actual divisor value minus one.)

                    Used if and only if ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG is set in BOOT_FLAGS0. That bit should be set only after this row and BOOTSEL_XOSC_CFG are both correctly programmed.</description>
          <addressOffset>0xAE</addressOffset>
          <size>0x10</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REFDIV</name>
              <description>PLL reference divisor, minus one.

                            Programming a value of 0 means a reference divisor of 1. Programming a value of 1 means a reference divisor of 2 (for exceptionally fast XIN inputs)</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>POSTDIV2</name>
              <description>PLL post-divide 2 divisor, in the range 1..7 inclusive.</description>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>POSTDIV1</name>
              <description>PLL post-divide 1 divisor, in the range 1..7 inclusive.</description>
              <bitRange>[11:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FBDIV</name>
              <description>PLL feedback divisor, in the range 16..320 inclusive.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTSEL_XOSC_CFG</name>
          <description>Non-default crystal oscillator configuration for the USB bootloader. (ECC)

                    These values may also be used by user code configuring the crystal oscillator.

                    Used if and only if ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG is set in BOOT_FLAGS0. That bit should be set only after this row and BOOTSEL_PLL_CFG are both correctly programmed.</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x10</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RANGE</name>
              <description>Value of the XOSC_CTRL_FREQ_RANGE register.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_15MHZ</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_30MHZ</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25_60MHZ</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40_100MHZ</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Value of the XOSC_STARTUP register</description>
              <bitRange>[13:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_WHITE_LABEL_ADDR</name>
          <description>Row index of the USB_WHITE_LABEL structure within OTP (ECC)

                    The table has 16 rows, each of which are also ECC and marked valid by the corresponding valid bit in USB_BOOT_FLAGS (ECC).

                    The entries are either _VALUEs where the 16 bit value is used as is, or _STRDEFs which acts as a pointers to a string value.

                    The value stored in a _STRDEF is two separate bytes: The low seven bits of the first (LSB) byte indicates the number of characters in the string, and the top bit of the first (LSB) byte if set to indicate that each character in the string is two bytes (Unicode) versus one byte if unset. The second (MSB) byte represents the location of the string data, and is encoded as the number of rows from this USB_WHITE_LABEL_ADDR; i.e. the row of the start of the string is USB_WHITE_LABEL_ADDR value + msb_byte.

                    In each case, the corresponding valid bit enables replacing the default value for the corresponding item provided by the boot rom.

                    Note that Unicode _STRDEFs are only supported for USB_DEVICE_PRODUCT_STRDEF, USB_DEVICE_SERIAL_NUMBER_STRDEF and USB_DEVICE_MANUFACTURER_STRDEF. Unicode values will be ignored if specified for other fields, and non-unicode values for these three items will be converted to Unicode characters by setting the upper 8 bits to zero.

                    Note that if the USB_WHITE_LABEL structure or the corresponding strings are not readable by BOOTSEL mode based on OTP permissions, or if alignment requirements are not met, then the corresponding default values are used.

                    The index values indicate where each field is located (row USB_WHITE_LABEL_ADDR value + index):</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>USB_WHITE_LABEL_ADDR</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_VID_VALUE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_PID_VALUE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_BCD_DEVICE_VALUE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_LANG_ID_VALUE</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_MANUFACTURER_STRDEF</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_PRODUCT_STRDEF</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_SERIAL_NUMBER_STRDEF</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_VOLUME_LABEL_STRDEF</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_SCSI_INQUIRY_VENDOR_STRDEF</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_SCSI_INQUIRY_PRODUCT_STRDEF</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_SCSI_INQUIRY_VERSION_STRDEF</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INDEX_HTM_REDIRECT_URL_STRDEF</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INDEX_HTM_REDIRECT_NAME_STRDEF</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INFO_UF2_TXT_MODEL_STRDEF</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INFO_UF2_TXT_BOARD_ID_STRDEF</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_SRC</name>
          <description>OTP start row for the OTP boot image. (ECC)

                    If OTP boot is enabled, the bootrom will load from this location into SRAM and then directly enter the loaded image. Note that the image must be signed if SECURE_BOOT_ENABLE is set. The image itself is assumed to be ECC-protected.

                    This must be an even number. Equivalently, the OTP boot image must start at a word-aligned location in the ECC read data address window.</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_SRC</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_LEN</name>
          <description>Length in rows of the OTP boot image. (ECC)

                    OTPBOOT_LEN must be even. The total image size must be a multiple of 4 bytes (32 bits).</description>
          <addressOffset>0xBE</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_LEN</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_DST0</name>
          <description>Bits 15:0 of the OTP boot image load destination (and entry point). (ECC)

                    This must be a location in main SRAM (main SRAM is addresses 0x20000000 through 0x20082000) and must be word-aligned.</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_DST0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_DST1</name>
          <description>Bits 31:16 of the OTP boot image load destination (and entry point). (ECC)

                    This must be a location in main SRAM (main SRAM is addresses 0x20000000 through 0x20082000) and must be word-aligned.</description>
          <addressOffset>0xC2</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_DST1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x100</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x102</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x104</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x106</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x108</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x10A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x10E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x110</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_8</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x112</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_9</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x114</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_10</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x116</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_11</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x118</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_12</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x11A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_13</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_14</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x11E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_15</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x120</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x122</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x124</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x126</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x128</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x12A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x12E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x130</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_8</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
