apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>BOOTKEY1_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x132</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_9</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x134</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_10</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x136</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_11</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x138</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_12</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x13A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_13</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_14</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x13E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_15</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x140</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x142</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x144</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x146</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x148</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x14A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x14E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x150</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_8</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x152</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_9</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x154</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_10</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x156</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_11</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x158</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_12</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x15A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_13</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_14</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x15E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_15</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x160</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x162</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x164</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x166</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x168</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x16A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x16E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x170</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_8</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x172</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_9</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x174</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_10</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x176</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_11</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x178</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_12</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x17A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_13</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_14</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x17E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_15</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_0</name>
          <description>Bits 15:0 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E90</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_1</name>
          <description>Bits 31:16 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E92</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_2</name>
          <description>Bits 47:32 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E94</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_3</name>
          <description>Bits 63:48 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E96</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_4</name>
          <description>Bits 79:64 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E98</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_5</name>
          <description>Bits 95:80 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E9A</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_6</name>
          <description>Bits 111:96 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E9C</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_7</name>
          <description>Bits 127:112 of OTP access key 1 (ECC)</description>
          <addressOffset>0x1E9E</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_0</name>
          <description>Bits 15:0 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EA0</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_1</name>
          <description>Bits 31:16 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EA2</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_2</name>
          <description>Bits 47:32 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EA4</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
