apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>KEY2_3</name>
          <description>Bits 63:48 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EA6</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_4</name>
          <description>Bits 79:64 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EA8</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_5</name>
          <description>Bits 95:80 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EAA</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_6</name>
          <description>Bits 111:96 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EAC</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_7</name>
          <description>Bits 127:112 of OTP access key 2 (ECC)</description>
          <addressOffset>0x1EAE</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_0</name>
          <description>Bits 15:0 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EB0</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_1</name>
          <description>Bits 31:16 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EB2</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_2</name>
          <description>Bits 47:32 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EB4</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_3</name>
          <description>Bits 63:48 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EB6</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_4</name>
          <description>Bits 79:64 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EB8</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_5</name>
          <description>Bits 95:80 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EBA</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_6</name>
          <description>Bits 111:96 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EBC</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_7</name>
          <description>Bits 127:112 of OTP access key 3 (ECC)</description>
          <addressOffset>0x1EBE</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_0</name>
          <description>Bits 15:0 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1EC0</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_1</name>
          <description>Bits 31:16 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1EC2</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_2</name>
          <description>Bits 47:32 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1EC4</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_3</name>
          <description>Bits 63:48 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1EC6</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_4</name>
          <description>Bits 79:64 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1EC8</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_5</name>
          <description>Bits 95:80 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1ECA</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_6</name>
          <description>Bits 111:96 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1ECC</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY4_7</name>
          <description>Bits 127:112 of OTP access key 4 (ECC)</description>
          <addressOffset>0x1ECE</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY4_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_0</name>
          <description>Bits 15:0 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1ED0</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_1</name>
          <description>Bits 31:16 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1ED2</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_2</name>
          <description>Bits 47:32 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1ED4</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_3</name>
          <description>Bits 63:48 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1ED6</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_4</name>
          <description>Bits 79:64 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1ED8</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_5</name>
          <description>Bits 95:80 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1EDA</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_6</name>
          <description>Bits 111:96 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1EDC</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY5_7</name>
          <description>Bits 127:112 of OTP access key 5 (ECC)</description>
          <addressOffset>0x1EDE</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY5_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_0</name>
          <description>Bits 15:0 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EE0</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_0</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_1</name>
          <description>Bits 31:16 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EE2</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_2</name>
          <description>Bits 47:32 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EE4</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_2</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_3</name>
          <description>Bits 63:48 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EE6</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_3</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_4</name>
          <description>Bits 79:64 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EE8</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_4</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_5</name>
          <description>Bits 95:80 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EEA</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_5</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_6</name>
          <description>Bits 111:96 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EEC</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_6</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY6_7</name>
          <description>Bits 127:112 of OTP access key 6 (ECC)</description>
          <addressOffset>0x1EEE</addressOffset>
          <size>0x10</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY6_7</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
