apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OTP_DATA_RAW</name>
      <description>Predefined OTP data layout for RP2350</description>
      <baseAddress>0x40134000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3FFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIPID0</name>
          <description>Bits 15:0 of public device ID. (ECC)

                    The CHIPID0..3 rows contain a 64-bit random identifier for this chip, which can be read from the USB bootloader PICOBOOT interface or from the get_sys_info ROM API.

                    The number of random bits makes the occurrence of twins exceedingly unlikely: for example, a fleet of a hundred million devices has a 99.97% probability of no twinned IDs. This is estimated to be lower than the occurrence of process errors in the assignment of sequential random IDs, and for practical purposes CHIPID may be treated as unique.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CHIPID0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID1</name>
          <description>Bits 31:16 of public device ID (ECC)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CHIPID1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID2</name>
          <description>Bits 47:32 of public device ID (ECC)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CHIPID2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID3</name>
          <description>Bits 63:48 of public device ID (ECC)</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CHIPID3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID0</name>
          <description>Bits 15:0 of private per-device random number (ECC)

                    The RANDID0..7 rows form a 128-bit random number generated during device test.

                    This ID is not exposed through the USB PICOBOOT GET_INFO command or the ROM `get_sys_info()` API. However note that the USB PICOBOOT OTP access point can read the entirety of page 0, so this value is not meaningfully private unless the USB PICOBOOT interface is disabled via the DISABLE_BOOTSEL_USB_PICOBOOT_IFC flag in BOOT_FLAGS0.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID1</name>
          <description>Bits 31:16 of private per-device random number (ECC)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID2</name>
          <description>Bits 47:32 of private per-device random number (ECC)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID3</name>
          <description>Bits 63:48 of private per-device random number (ECC)</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID4</name>
          <description>Bits 79:64 of private per-device random number (ECC)</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID5</name>
          <description>Bits 95:80 of private per-device random number (ECC)</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID6</name>
          <description>Bits 111:96 of private per-device random number (ECC)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDID7</name>
          <description>Bits 127:112 of private per-device random number (ECC)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RANDID7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROSC_CALIB</name>
          <description>Ring oscillator frequency in kHz, measured during manufacturing (ECC)

