apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    This is measured at 1.1 V, at room temperature, with the ROSC configuration registers in their reset state.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ROSC_CALIB</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOSC_CALIB</name>
          <description>Low-power oscillator frequency in Hz, measured during manufacturing (ECC)

                    This is measured at 1.1V, at room temperature, with the LPOSC trim register in its reset state.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>LPOSC_CALIB</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NUM_GPIOS</name>
          <description>The number of main user GPIOs (bank 0). Should read 48 in the QFN80 package, and 30 in the QFN60 package. (ECC)</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>NUM_GPIOS</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INFO_CRC0</name>
          <description>Lower 16 bits of CRC32 of OTP addresses 0x00 through 0x6b (polynomial 0x4c11db7, input reflected, output reflected, seed all-ones, final XOR all-ones) (ECC)</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>INFO_CRC0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INFO_CRC1</name>
          <description>Upper 16 bits of CRC32 of OTP addresses 0x00 through 0x6b (ECC)</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>INFO_CRC1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0</name>
          <description>Page 0 critical boot flags (RBIT-8)</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RISCV_DISABLE</name>
              <description>Permanently disable RISC-V processors (Hazard3)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ARM_DISABLE</name>
              <description>Permanently disable ARM processors (Cortex-M33)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0_R1</name>
          <description>Redundant copy of CRIT0</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT0_R1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0_R2</name>
          <description>Redundant copy of CRIT0</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT0_R2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0_R3</name>
          <description>Redundant copy of CRIT0</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT0_R3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0_R4</name>
          <description>Redundant copy of CRIT0</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT0_R4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0_R5</name>
          <description>Redundant copy of CRIT0</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT0_R5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0_R6</name>
          <description>Redundant copy of CRIT0</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT0_R6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT0_R7</name>
          <description>Redundant copy of CRIT0</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT0_R7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1</name>
          <description>Page 1 critical boot flags (RBIT-8)</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GLITCH_DETECTOR_SENS</name>
              <description>Increase the sensitivity of the glitch detectors from their default.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GLITCH_DETECTOR_ENABLE</name>
              <description>Arm the glitch detectors to reset the system if an abnormal clock/power event is observed.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT_ARCH</name>
              <description>Set the default boot architecture, 0=ARM 1=RISC-V. Ignored if ARM_DISABLE, RISCV_DISABLE or SECURE_BOOT_ENABLE is set.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_DISABLE</name>
              <description>Disable all debug access</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_DEBUG_DISABLE</name>
              <description>Disable Secure debug access</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_ENABLE</name>
              <description>Enable boot signature enforcement, and permanently disable the RISC-V cores.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1_R1</name>
          <description>Redundant copy of CRIT1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT1_R1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1_R2</name>
          <description>Redundant copy of CRIT1</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT1_R2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1_R3</name>
          <description>Redundant copy of CRIT1</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT1_R3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1_R4</name>
          <description>Redundant copy of CRIT1</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT1_R4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1_R5</name>
          <description>Redundant copy of CRIT1</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT1_R5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1_R6</name>
          <description>Redundant copy of CRIT1</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT1_R6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRIT1_R7</name>
          <description>Redundant copy of CRIT1</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>CRIT1_R7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_FLAGS0</name>
          <description>Disable/Enable boot paths/features in the RP2350 mask ROM. Disables always supersede enables. Enables are provided where there are other configurations in OTP that must be valid. (RBIT-3)</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISABLE_SRAM_WINDOW_BOOT</name>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DISABLE_XIP_ACCESS_ON_SRAM_ENTRY</name>
              <description>Disable all access to XIP after entering an SRAM binary.

