apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                            A KEY_VALID bit is ignored if the corresponding KEY_INVALID bit is set. Boot keys are considered valid only when KEY_VALID is set and KEY_INVALID is clear.

                            Do not mark a boot key as KEY_VALID if it does not contain a valid SHA-256 hash of your secp256k1 public key. Verify keys after programming, before setting the KEY_VALID bits -- a boot key with uncorrectable ECC faults will render your device unbootable if secure boot is enabled.

                            Do not enable secure boot without first installing a valid key. This will render your device unbootable.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_FLAGS1_R1</name>
          <description>Redundant copy of BOOT_FLAGS1</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOT_FLAGS1_R1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOT_FLAGS1_R2</name>
          <description>Redundant copy of BOOT_FLAGS1</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOT_FLAGS1_R2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFAULT_BOOT_VERSION0</name>
          <description>Default boot version thermometer counter, bits 23:0 (RBIT-3)</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DEFAULT_BOOT_VERSION0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFAULT_BOOT_VERSION0_R1</name>
          <description>Redundant copy of DEFAULT_BOOT_VERSION0</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DEFAULT_BOOT_VERSION0_R1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFAULT_BOOT_VERSION0_R2</name>
          <description>Redundant copy of DEFAULT_BOOT_VERSION0</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DEFAULT_BOOT_VERSION0_R2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFAULT_BOOT_VERSION1</name>
          <description>Default boot version thermometer counter, bits 47:24 (RBIT-3)</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DEFAULT_BOOT_VERSION1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFAULT_BOOT_VERSION1_R1</name>
          <description>Redundant copy of DEFAULT_BOOT_VERSION1</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DEFAULT_BOOT_VERSION1_R1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEFAULT_BOOT_VERSION1_R2</name>
          <description>Redundant copy of DEFAULT_BOOT_VERSION1</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DEFAULT_BOOT_VERSION1_R2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_DEVINFO</name>
          <description>Stores information about external flash device(s). (ECC)

                    Assumed to be valid if BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is set.</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CS1_SIZE</name>
              <description>The size of the flash/PSRAM device on chip select 1 (addressable at 0x11000000 through 0x11ffffff).

                            A value of zero is decoded as a size of zero (no device). Nonzero values are decoded as 4kiB &lt;&lt; CS1_SIZE. For example, four megabytes is encoded with a CS1_SIZE value of 10, and 16 megabytes is encoded with a CS1_SIZE value of 12.

                            When BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is not set, a default of zero is used.</description>
              <bitRange>[23:12]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64k</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CS0_SIZE</name>
              <description>The size of the flash/PSRAM device on chip select 0 (addressable at 0x10000000 through 0x10ffffff).

                            A value of zero is decoded as a size of zero (no device). Nonzero values are decoded as 4kiB &lt;&lt; CS0_SIZE. For example, four megabytes is encoded with a CS0_SIZE value of 10, and 16 megabytes is encoded with a CS0_SIZE value of 12.

                            When BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is not set, a default of 12 (16 MiB) is used.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64k</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D8H_ERASE_SUPPORTED</name>
              <description>If true, all attached devices are assumed to support (or ignore, in the case of PSRAM) a block erase command with a command prefix of D8h, an erase size of 64 kiB, and a 24-bit address. Almost all 25-series flash devices support this command.

                            If set, the bootrom will use the D8h erase command where it is able, to accelerate bulk erase operations. This makes flash programming faster.

                            When BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is not set, this field defaults to false.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CS1_GPIO</name>
              <description>Indicate a GPIO number to be used for the secondary flash chip select (CS1), which selects the external QSPI device mapped at system addresses 0x11000000 through 0x11ffffff. There is no such configuration for CS0, as the primary chip select has a dedicated pin.

                            On RP2350 the permissible GPIO numbers are 0, 8, 19 and 47.

                            Ignored if CS1_size is zero. If CS1_SIZE is nonzero, the bootrom will automatically configure this GPIO as a second chip select upon entering the flash boot path, or entering any other path that may use the QSPI flash interface, such as BOOTSEL mode (nsboot).</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PARTITION_SLOT_SIZE</name>
          <description>Gap between partition table slot 0 and slot 1 at the start of flash (the default size is 4096 bytes) (ECC) Enabled by the OVERRIDE_FLASH_PARTITION_SLOT_SIZE bit in BOOT_FLAGS, the size is 4096 * (value + 1)</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>FLASH_PARTITION_SLOT_SIZE</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTSEL_LED_CFG</name>
          <description>Pin configuration for LED status, used by USB bootloader. (ECC) 
                    Must be valid if BOOT_FLAGS0_ENABLE_BOOTSEL_LED is set.</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACTIVELOW</name>
              <description>LED is active-low. (Default: active-high.)</description>
              <bitRange>[23:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PIN</name>
              <description>GPIO index to use for bootloader activity LED.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTSEL_PLL_CFG</name>
          <description>Optional PLL configuration for BOOTSEL mode. (ECC)

