apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
                    In each case, the corresponding valid bit enables replacing the default value for the corresponding item provided by the boot rom.

                    Note that Unicode _STRDEFs are only supported for USB_DEVICE_PRODUCT_STRDEF, USB_DEVICE_SERIAL_NUMBER_STRDEF and USB_DEVICE_MANUFACTURER_STRDEF. Unicode values will be ignored if specified for other fields, and non-unicode values for these three items will be converted to Unicode characters by setting the upper 8 bits to zero.

                    Note that if the USB_WHITE_LABEL structure or the corresponding strings are not readable by BOOTSEL mode based on OTP permissions, or if alignment requirements are not met, then the corresponding default values are used.

                    The index values indicate where each field is located (row USB_WHITE_LABEL_ADDR value + index):</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>USB_WHITE_LABEL_ADDR</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_VID_VALUE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_PID_VALUE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_BCD_DEVICE_VALUE</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_LANG_ID_VALUE</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_MANUFACTURER_STRDEF</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_PRODUCT_STRDEF</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_DEVICE_SERIAL_NUMBER_STRDEF</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_VOLUME_LABEL_STRDEF</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_SCSI_INQUIRY_VENDOR_STRDEF</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_SCSI_INQUIRY_PRODUCT_STRDEF</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_SCSI_INQUIRY_VERSION_STRDEF</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INDEX_HTM_REDIRECT_URL_STRDEF</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INDEX_HTM_REDIRECT_NAME_STRDEF</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INFO_UF2_TXT_MODEL_STRDEF</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INDEX_INFO_UF2_TXT_BOARD_ID_STRDEF</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_SRC</name>
          <description>OTP start row for the OTP boot image. (ECC)

                    If OTP boot is enabled, the bootrom will load from this location into SRAM and then directly enter the loaded image. Note that the image must be signed if SECURE_BOOT_ENABLE is set. The image itself is assumed to be ECC-protected.

                    This must be an even number. Equivalently, the OTP boot image must start at a word-aligned location in the ECC read data address window.</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_SRC</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_LEN</name>
          <description>Length in rows of the OTP boot image. (ECC)

                    OTPBOOT_LEN must be even. The total image size must be a multiple of 4 bytes (32 bits).</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_LEN</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_DST0</name>
          <description>Bits 15:0 of the OTP boot image load destination (and entry point). (ECC)

                    This must be a location in main SRAM (main SRAM is addresses 0x20000000 through 0x20082000) and must be word-aligned.</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_DST0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBOOT_DST1</name>
          <description>Bits 31:16 of the OTP boot image load destination (and entry point). (ECC)

                    This must be a location in main SRAM (main SRAM is addresses 0x20000000 through 0x20082000) and must be word-aligned.</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>OTPBOOT_DST1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_8</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_9</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_10</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_11</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_12</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_13</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_14</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY0_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 0 (ECC)</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY0_15</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_8</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_9</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_10</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_11</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_12</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_13</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_14</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY1_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 1 (ECC)</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY1_15</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
