apple/swift-embedded-examples/pico2-neopixel/Sources/RP2350/rp235x.patched.svd
        <register>
          <name>BOOTKEY2_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_8</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_9</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_10</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_11</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_12</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_13</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_14</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY2_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 2 (ECC)</description>
          <addressOffset>0x2BC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY2_15</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_0</name>
          <description>Bits 15:0 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2C0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_1</name>
          <description>Bits 31:16 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_2</name>
          <description>Bits 47:32 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2C8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_3</name>
          <description>Bits 63:48 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2CC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_4</name>
          <description>Bits 79:64 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_5</name>
          <description>Bits 95:80 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2D4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_6</name>
          <description>Bits 111:96 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2D8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_7</name>
          <description>Bits 127:112 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_8</name>
          <description>Bits 143:128 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_8</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_9</name>
          <description>Bits 159:144 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2E4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_9</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_10</name>
          <description>Bits 175:160 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2E8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_10</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_11</name>
          <description>Bits 191:176 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2EC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_11</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_12</name>
          <description>Bits 207:192 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2F0</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_12</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_13</name>
          <description>Bits 223:208 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2F4</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_13</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_14</name>
          <description>Bits 239:224 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2F8</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_14</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTKEY3_15</name>
          <description>Bits 255:240 of SHA-256 hash of boot key 3 (ECC)</description>
          <addressOffset>0x2FC</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOTKEY3_15</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_0</name>
          <description>Bits 15:0 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D20</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_1</name>
          <description>Bits 31:16 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D24</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_2</name>
          <description>Bits 47:32 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D28</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_3</name>
          <description>Bits 63:48 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D2C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_4</name>
          <description>Bits 79:64 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D30</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_5</name>
          <description>Bits 95:80 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D34</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_6</name>
          <description>Bits 111:96 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D38</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1_7</name>
          <description>Bits 127:112 of OTP access key 1 (ECC)</description>
          <addressOffset>0x3D3C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY1_7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_0</name>
          <description>Bits 15:0 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D40</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_1</name>
          <description>Bits 31:16 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D44</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_2</name>
          <description>Bits 47:32 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D48</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_3</name>
          <description>Bits 63:48 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D4C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_4</name>
          <description>Bits 79:64 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D50</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_5</name>
          <description>Bits 95:80 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D54</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_6</name>
          <description>Bits 111:96 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D58</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_6</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2_7</name>
          <description>Bits 127:112 of OTP access key 2 (ECC)</description>
          <addressOffset>0x3D5C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY2_7</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_0</name>
          <description>Bits 15:0 of OTP access key 3 (ECC)</description>
          <addressOffset>0x3D60</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_0</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_1</name>
          <description>Bits 31:16 of OTP access key 3 (ECC)</description>
          <addressOffset>0x3D64</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_1</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_2</name>
          <description>Bits 47:32 of OTP access key 3 (ECC)</description>
          <addressOffset>0x3D68</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_2</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_3</name>
          <description>Bits 63:48 of OTP access key 3 (ECC)</description>
          <addressOffset>0x3D6C</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_3</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_4</name>
          <description>Bits 79:64 of OTP access key 3 (ECC)</description>
          <addressOffset>0x3D70</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_4</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3_5</name>
          <description>Bits 95:80 of OTP access key 3 (ECC)</description>
          <addressOffset>0x3D74</addressOffset>
          <size>0x20</size>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>KEY3_5</name>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
